OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
/**************************************************************************//**
 * @file     M0519.h
 * @version  V3.0
 * $Revision: 105 $
 * $Date: 15/07/07 5:00p $
 * @brief    M0519 Series Peripheral Access Layer Header File
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/



/**
  \mainpage Introduction
  *
  *
  * This user manual describes the usage of M0519 Series MCU device driver
  *
  * <b>Disclaimer</b>
  *
  * The Software is furnished "AS IS", without warranty as to performance or results, and
  * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
  * warranties, express, implied or otherwise, with regard to the Software, its use, or
  * operation, including without limitation any and all warranties of merchantability, fitness
  * for a particular purpose, and non-infringement of intellectual property rights.
  *
  * <b>Copyright Notice</b>
  *
  * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
  */

/**
  * \page PG_REV Revision History
  *
  *
  * <b>Revision 3.00.001</b>
  * \li First release to support M0519.
*/

#ifndef __M0519_H__
#define __M0519_H__

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
*/

/** @addtogroup CMSIS Device Definitions for CMSIS
  Interrupt Number Definition and Configurations for CMSIS
  @{
*/

/**
 * @details  Interrupt Number Definition. The maximum of 32 Specific Interrupts are possible.
 */

typedef enum IRQn
{
    /******  Cortex-M0 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn         = -14,    /*!< Non Maskable Interrupt                                 */
    HardFault_IRQn              = -13,    /*!< Cortex-M0 Hard Fault Interrupt                         */
    SVCall_IRQn                 = -5,     /*!< Cortex-M0 SV Call Interrupt                            */
    PendSV_IRQn                 = -2,     /*!< Cortex-M0 Pend SV Interrupt                            */
    SysTick_IRQn                = -1,     /*!< Cortex-M0 System Tick Interrupt                        */

    /******  ARMIKMCU Swift specific Interrupt Numbers ************************************************/
    BOD_IRQn                  = 0,        /*!< Brown-Out Low Voltage Detected Interrupt               */
    WDT_IRQn                  = 1,        /*!< Watch Dog Timer Interrupt                              */
    EINT0_IRQn                = 2,        /*!< EINT0 Interrupt                                        */
    EINT1_IRQn                = 3,        /*!< EINT1 Interrupt                                        */
    GPG0_IRQn                 = 4,        /*!< GPIO_P0P1P2P3P4 Interrupt                              */
    GPG1_IRQn                 = 5,        /*!< GPIO_P5P6P7P8P9PA Interrupt                            */
    BPWM0_IRQn                 = 6,       /*!< BPWM0 Interrupt                                        */
    EADC0_IRQn                = 7,        /*!< EADC0 Interrupt                                        */
    TMR0_IRQn                 = 8,        /*!< TIMER0 Interrupt                                       */
    TMR1_IRQn                 = 9,        /*!< TIMER1 Interrupt                                       */
    TMR2_IRQn                 = 10,       /*!< TIMER2 Interrupt                                       */
    TMR3_IRQn                 = 11,       /*!< TIMER3 Interrupt                                       */
    UART0_IRQn                = 12,       /*!< UART0 Interrupt                                        */
    UART1_IRQn                = 13,       /*!< UART1 Interrupt                                        */
    SPI0_IRQn                 = 14,       /*!< SPI0 Interrupt                                         */
    SPI1_IRQn                 = 15,       /*!< SPI1 Interrupt                                         */
    SPI2_IRQn                 = 16,       /*!< SPI2 Interrupt                                         */
    REV_IRQn                  = 17,       
    I2C0_IRQn                 = 18,       /*!< I2C0 Interrupt                                         */
    CKD_IRQn                  = 19,       /*!< CKD Interrupt                                          */
    EPWM0_IRQn                = 21,       /*!< Enhanced PWM0 Interrupt                                */
    EPWM1_IRQn                = 22,       /*!< Enhanced PWM1 Interrupt                                */
    ECAP0_IRQn                = 23,       /*!< Enhanced Input Capture 0 Interrupt                     */
    ECAP1_IRQn                = 24,       /*!< Enhanced Input Capture 1 Interrupt                     */
    ACMP_IRQn                 = 25,       /*!< ACMP  Interrupt                                        */
    REV0_IRQn                 = 26,
    REV1_IRQn                 = 27,
    PWRWU_IRQn                = 28,       /*!< Power Down Wake Up Interrupt                           */
    EADC1_IRQn                = 29,       /*!< EADC1 Interrupt                                        */
    EADC2_IRQn                = 30,       /*!< EADC2 Interrupt                                        */
    EADC3_IRQn                = 31,       /*!< EADC3 Interrupt                                        */
} IRQn_Type;


/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __MPU_PRESENT           0       /*!< armikcmu does not provide a MPU present or not       */
#define __NVIC_PRIO_BITS        2       /*!< armikcmu Supports 2 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig  0       /*!< Set to 1 if different SysTick Config is used         */


/*@}*/ /* end of group CMSIS */


#include "core_cm0.h"                   /* Cortex-M0 processor and core peripherals               */
#include "system_M0519.h"        /* M0519 System                                          */

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


/*-------------------------------- Device Specific Peripheral registers structures ---------------------*/
/** @addtogroup REGISTER Control Register
  Peripheral Control Registers
  @{
 */

/*---------------------- Analog Comparator Controller -------------------------*/
/**
    @addtogroup ACMP Analog Comparator Controller (ACMP)
    Memory Mapped Structure for ACMP Controller
@{ */


typedef struct
{


    /**
     * @var ACMP_T::CR
     * Offset: 0x00 ~ 0x08 Analog Comparator 0 ~ 2 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ACMP_EN   |Comparator Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |ACMPIE    |Comparator Interrupt Enable
     * |        |          |0 = Interrupt function Disabled.
     * |        |          |1 = Interrupt function Enabled.
     * |[2]     |ACMP_HYS_EN |Comparator Hysteresis Enable
     * |        |          |0 = Hysteresis function Disabled (Default).
     * |        |          |1 = Hysteresis function Enabled.
     * |[3]     |CP        |Comparator Positive Input Selection
     * |        |          |0 = The comparator reference pin ACMPx_P (x=0,1) is selected as the positive comparator input.
     * |        |          |1 = The internal OP amplifier output is selected as the positive comparator input.
     * |        |          |Note: This bit field is reserved in ACMP2CR register.
     * |[4]     |CN        |Comparator Negative Input Selection
     * |        |          |0 = The comparator reference pin ACMPx_N (x=0,1,2) is selected as the negative comparator input.
     * |        |          |1 = Internal band-gap reference voltage is selected as the source of negative
     * |        |          |    comparator input.
     * |[6]     |ACMPINV  |Comparator Output Inverse Enable
     * |        |          |0 = Comparator analog output inverse function is Disabled.
     * |        |          |1 = Comparator analog output inverse function is Enabled.
     * @var ACMP_T::SR
     * Offset: 0x0C  Analog Comparator Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ACMPF0    |Comparator 0 Interrupt Flag
     * |        |          |This bit is set by hardware whenever the comparator 0 output changes state.
     * |        |          |This will cause an interrupt if ACMPIE (ACMP0CR[1]) is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[1]     |ACMPF1    |Comparator 1 Interrupt Flag
     * |        |          |This bit is set by hardware whenever the comparator 1 output changes state.
     * |        |          |This will cause an interrupt if ACMPIE (ACMP1CR[1]) is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[2]     |ACMPF2    |Comparator 2 Interrupt Flag
     * |        |          |This bit is set by hardware whenever the comparator 2 output changes state.
     * |        |          |This will cause an interrupt if ACMPIE (ACMP2CR[1]) is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[4]     |OPDF0     |OP Amplifier 0 Schmitt Trigger Digital Output Interrupt Flag
     * |        |          |OPDF0 interrupt flag is set by hardware whenever the OP amplifier 0 Schmitt
     * |        |          |trigger non-inverting buffer digital output changes state.
     * |        |          |Note: This bit is remapping from OPASR[4] and writing 1 to ACMPSR[4] or OPASR[4] can clear this bit.
     * |[5]     |OPDF1     |OP Amplifier 1 Schmitt Trigger Digital Output Interrupt Flag
     * |        |          |OPDF1 interrupt flag is set by hardware whenever the OP amplifier 1 Schmitt
     * |        |          |trigger non-inverting buffer digital output changes state.
     * |        |          |Note: This bit is remapping from OPASR[5] and writing 1 to ACMPSR[5] or OPASR[5] can clear this bit.
     * |[8]     |CO0       |Comparator 0 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 0 is disabled (ACMP0_EN = 0).
     * |[9]     |CO1       |Comparator 1 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 1 is disabled (ACMP1_EN = 0).
     * |[10]    |CO2       |Comparator 2 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 2 is disabled (ACMP2_EN = 0).
     */

    __IO uint32_t CR[3];         /* Offset: 0x00 ~ 0x08 Analog Comparator 0 ~ 2 Control Register                     */
    __IO uint32_t SR;            /* Offset: 0x0C  Analog Comparator Status Register                                  */

} ACMP_T;



/**
    @addtogroup ACMP_CONST ACMP Bit Field Definition
    Constant Definitions for ACMP Controller
@{ */


