OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
/* CR Bit Field Definitions */
#define ACMP_CR_ACMPINV_Pos       6                                   /*!< ACMP_T::CR: ACMPINV Position */
#define ACMP_CR_ACMPINV_Msk       (1ul << ACMP_CR_ACMPINV_Pos)        /*!< ACMP_T::CR: ACMPINV Mask */

#define ACMP_CR_CN_Pos            4                                   /*!< ACMP_T::CR: CN Position */
#define ACMP_CR_CN_Msk            (1ul << ACMP_CR_CN_Pos)             /*!< ACMP_T::CR: CN Mask */

#define ACMP_CR_CP_Pos            3                                   /*!< ACMP_T::CR: CP Position */
#define ACMP_CR_CP_Msk            (1ul << ACMP_CR_CP_Pos)             /*!< ACMP_T::CR: CP Mask */

#define ACMP_CR_ACMP_HYS_EN_Pos   2                                   /*!< ACMP_T::CR: ACMP_HYS_EN Position */
#define ACMP_CR_ACMP_HYS_EN_Msk   (1ul << ACMP_CR_ACMP_HYS_EN_Pos)    /*!< ACMP_T::CR: ACMP_HYS_EN Mask */

#define ACMP_CR_ACMPIE_Pos        1                                   /*!< ACMP_T::CR: ACMPIE Position */
#define ACMP_CR_ACMPIE_Msk        (1ul << ACMP_CR_ACMPIE_Pos)         /*!< ACMP_T::CR: ACMPIE Mask */

#define ACMP_CR_ACMP_EN_Pos       0                                   /*!< ACMP_T::CR: ACMP_EN Position */
#define ACMP_CR_ACMP_EN_Msk       (1ul << ACMP_CR_ACMP_EN_Pos)        /*!< ACMP_T::CR: ACMP_EN Mask */

/* SR Bit Field Definitions */
#define ACMP_SR_CO2_Pos     10                               /*!< ACMP_T::SR: CO2 Position */
#define ACMP_SR_CO2_Msk     (1ul << ACMP_SR_CO2_Pos)         /*!< ACMP_T::SR: CO2 Mask */

#define ACMP_SR_CO1_Pos     9                                /*!< ACMP_T::SR: CO1 Position */
#define ACMP_SR_CO1_Msk     (1ul << ACMP_SR_CO1_Pos)         /*!< ACMP_T::SR: CO1 Mask */

#define ACMP_SR_CO0_Pos     8                                /*!< ACMP_T::SR: CO0 Position */
#define ACMP_SR_CO0_Msk     (1ul << ACMP_SR_CO0_Pos)         /*!< ACMP_T::SR: CO0 Mask */

#define ACMP_SR_OPDF1_Pos   5                                /*!< ACMP_T::SR: OPDF1 Position */
#define ACMP_SR_OPDF1_Msk   (1ul << ACMP_SR_OPDF1_Pos)       /*!< ACMP_T::SR: OPDF1 Mask */

#define ACMP_SR_OPDF0_Pos   4                                /*!< ACMP_T::SR: OPDF0 Position */
#define ACMP_SR_OPDF0_Msk   (1ul << ACMP_SR_OPDF0_Pos)       /*!< ACMP_T::SR: OPDF0 Mask */

#define ACMP_SR_ACMPF2_Pos   2                               /*!< ACMP_T::SR: ACMPF2 Position */
#define ACMP_SR_ACMPF2_Msk   (1ul << ACMP_SR_ACMPF2_Pos)     /*!< ACMP_T::SR: ACMPF2 Mask */

#define ACMP_SR_ACMPF1_Pos   1                               /*!< ACMP_T::SR: ACMPF1 Position */
#define ACMP_SR_ACMPF1_Msk   (1ul << ACMP_SR_ACMPF1_Pos)     /*!< ACMP_T::SR: ACMPF1 Mask */

#define ACMP_SR_ACMPF0_Pos   0                               /*!< ACMP_T::SR: ACMPF0 Position */
#define ACMP_SR_ACMPF0_Msk   (1ul << ACMP_SR_ACMPF0_Pos)     /*!< ACMP_T::SR: ACMPF0 Mask */

/*@}*/ /* end of group ACMP_CONST */
/*@}*/ /* end of group ACMP */



/*---------------------- Basic Pulse Width Modulation Controller -------------------------*/
/**
    @addtogroup Basic PWM Pulse Width Modulation Controller (BPWM)
    Memory Mapped Structure for BPWM Controller
@{ */

typedef struct
{


    /**
     * @var BPWM_T::PPR
     * Offset: 0x00  Basic PWM Prescaler Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits     |Field     |Descriptions
     * | :----:  | :----:   | :---- |
     * |[7:0]    |CP01      |Clock Prescaler
     * |         |          |Clock input is divided by (CP01 + 1) before it is fed to the corresponding PWM-timer
     * |         |          |If CP01=0, then the clock prescaler output clock will be stopped.
     * |         |          |So corresponding PWM-timer will also be stopped.
     * |[23:16]  |DZI01     |Dead-Zone Interval For Pair Of Channel 0 And Channel 1
     * |         |          |These 8-bit determine the Dead-zone length.
     * |         |          |The unit time of Dead-zone length = [(prescale+1)*(clock source divider)]/ BPWM_CLK.
     * @var BPWM_T::CSR
     * Offset: 0x04  Basic PWM Clock Source Divider Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits      |Field     |Descriptions
     * | :----:   | :----:   | :---- |
     * |[2:0]     |CSR0      |PWM Timer 0 Clock Source Divider Selection
     * |          |          |Select clock source divider for timer 0.
     * |          |          |(Table is the same as CSR1)
     * |[6:4]     |CSR1      |PWM Timer 1 Clock Source Divider Selection
     * |          |          |Select clock source divider for timer 1.
     * |          |          |000 = 2
     * |          |          |001 = 4
     * |          |          |010 = 8
     * |          |          |011 = 16
     * |          |          |100 = 1
     * @var BPWM_T::PCR
     * Offset: 0x08  Basic PWM Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits     |Field         |Descriptions
     * | :----:  | :----:       | :---- |
     * |[0]      |CH0EN         |PWM-Timer 0 Enable
     * |         |              |0 = The corresponding PWM-Timer stops running.
     * |         |              |1 = The corresponding PWM-Timer starts running.
     * |[1]      |CH0PINV       |PWM-Timer 0 Output Polar Inverse Enable
     * |         |              |0 = PWM0 output polar inverse disabled.
     * |         |              |1 = PWM0 output polar inverse enabled.
     * |[2]      |CH0INV        |PWM-Timer 0 Output Inverter Enable
     * |         |              |0 = Inverter disabled.
     * |         |              |1 = Inverter enabled.
     * |[3]      |CH0MOD        |PWM-Timer 0 Auto-Reload/One-Shot Mode
     * |         |              |0 = One-shot mode.
     * |         |              |1 = Auto-reload mode.
     * |         |              |Note: If there is a transition at this bit, it will cause CNR0 and CMR0 be cleared.
     * |[4]      |DZEN01        |Dead-Zone 0 Generator Enable
     * |         |              |0 = Disabled.
     * |         |              |1 = Enabled.
     * |         |              |Note: When Dead-zone generator is enabled, the pair of PWM0 and PWM1 becomes a complementary pair.
     * |[8]      |CH1EN         |PWM-Timer 1 Enable
     * |         |              |0 = Corresponding PWM-Timer stopped.
     * |         |              |1 = Corresponding PWM-Timer start running.
     * |[9]      |CH1PINV       |PWM-Timer 1 Output Polar Inverse Enable
     * |         |              |0 = PWM1 output polar inverse disabled.
     * |         |              |1 = PWM1 output polar inverse enabled.
     * |[10]     |CH1INV        |PWM-Timer 1 Output Inverter Enable
     * |         |              |0 = Inverter disable.
     * |         |              |1 = Inverter enable.
     * |[11]     |CH1MOD        |PWM-Timer 1 Auto-Reload/One-Shot Mode
     * |         |              |0 = One-shot mode.
     * |         |              |1 = Auto-reload mode.
     * |         |              |Note: If there is a transition at this bit, it will cause CNR1 and CMR1 be cleared.
     * |[30]     |PWM01TYPE     |PWM01 Aligned Type Selection Bit
     * |         |              |0 = Edge-aligned type.
     * |         |              |1 = Center-aligned type.
     * @var BPWM_T::CNR0
     * Offset: 0x0C  Basic PWM Counter Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CNRx      |PWM Timer Loaded Value
     * |        |          |CNR determines the PWM period.
     * |        |          |PWM frequency = BPWM_CLK/[(prescale+1)*(clock divider)*(CNR+1)].
     * |        |          |For Edge-aligned type:
     * |        |          | Duty ratio = (CMR+1)/(CNR+1).
     * |        |          | CMR >= CNR: PWM output is always high.
     * |        |          | CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
     * |        |          | CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit.
     * |        |          |For Center-aligned type:
     * |        |          | Duty ratio = [(2 x CMR) + 1]/[2 x (CNR+1)].
     * |        |          | CMR > CNR: PWM output is always high.
     * |        |          | CMR <= CNR: PWM low width = 2 x (CNR-CMR) + 1 unit; PWM high width = (2 x CMR) + 1 unit.
     * |        |          | CMR = 0: PWM low width = 2 x CNR + 1 unit; PWM high width = 1 unit.
     * |        |          |(Unit = one PWM clock cycle).
     * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
     * |        |          |Note: When PWM operating at Center-aligned type, CNR value should be set between 0x0000 to 0xFFFE.
     * |        |          |If CNR equal to 0xFFFF, the PWM will work unpredictable.
     * |        |          |Note: When CNR value is set to 0, PWM output is always high.
     * @var BPWM_T::CMR0
     * Offset: 0x10  Basic PWM Comparator Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMRx      |PWM Comparator Register
     * |        |          |CMR determines the PWM duty.
     * |        |          |PWM frequency = BPWM_CLK/[(prescale+1)*(clock divider)*(CNR+1)].
     * |        |          |For Edge-aligned type:
     * |        |          | Duty ratio = (CMR+1)/(CNR+1).
     * |        |          | CMR >= CNR: PWM output is always high.
     * |        |          | CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
     * |        |          | CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit.
     * |        |          |For Center-aligned type:
     * |        |          | Duty ratio = [(2 x CMR) + 1]/[2 x (CNR+1)].
     * |        |          | CMR > CNR: PWM output is always high.
     * |        |          | CMR <= CNR: PWM low width = 2 x (CNR-CMR) + 1 unit; PWM high width = (2 x CMR) + 1 unit.
     * |        |          | CMR = 0: PWM low width = 2 x CNR + 1 unit; PWM high width = 1 unit.
     * |        |          |(Unit = one PWM clock cycle).
     * |        |          |Note: Any write to CMR will take effect in next PWM cycle.
     * @var BPWM_T::PDR0
     * Offset: 0x14  Basic PWM Data Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PDRx      |PWM Data Register
     * |        |          |User can monitor PDR to know the current value in 16-bit counter.
     * @var BPWM_T::CNR1
     * Offset: 0x18  Basic PWM Counter Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CNRx      |PWM Timer Loaded Value
     * |        |          |CNR determines the PWM period.
     * |        |          |PWM frequency = BPWM_CLK/[(prescale+1)*(clock divider)*(CNR+1)].
     * |        |          |For Edge-aligned type:
     * |        |          | Duty ratio = (CMR+1)/(CNR+1).
     * |        |          | CMR >= CNR: PWM output is always high.
     * |        |          | CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
     * |        |          | CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit.
     * |        |          |For Center-aligned type:
     * |        |          | Duty ratio = [(2 x CMR) + 1]/[2 x (CNR+1)].
     * |        |          | CMR > CNR: PWM output is always high.
     * |        |          | CMR <= CNR: PWM low width = 2 x (CNR-CMR) + 1 unit; PWM high width = (2 x CMR) + 1 unit.
     * |        |          | CMR = 0: PWM low width = 2 x CNR + 1 unit; PWM high width = 1 unit.
     * |        |          |(Unit = one PWM clock cycle).
     * |        |          |Note: Any write to CNR will take effect in next PWM cycle.
     * |        |          |Note: When PWM operating at Center-aligned type, CNR value should be set between 0x0000 to 0xFFFE.
     * |        |          |If CNR equal to 0xFFFF, the PWM will work unpredictable.
     * |        |          |Note: When CNR value is set to 0, PWM output is always high.
     * @var BPWM_T::CMR1
     * Offset: 0x1C  Basic PWM Comparator Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMRx      |PWM Comparator Register
     * |        |          |CMR determines the PWM duty.
     * |        |          |PWM frequency = BPWM_CLK/[(prescale+1)*(clock divider)*(CNR+1)].
     * |        |          |For Edge-aligned type:
     * |        |          | Duty ratio = (CMR+1)/(CNR+1).
     * |        |          | CMR >= CNR: PWM output is always high.
     * |        |          | CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
     * |        |          | CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit.
     * |        |          |For Center-aligned type:
     * |        |          | Duty ratio = [(2 x CMR) + 1]/[2 x (CNR+1)].
     * |        |          | CMR > CNR: PWM output is always high.
     * |        |          | CMR <= CNR: PWM low width = 2 x (CNR-CMR) + 1 unit; PWM high width = (2 x CMR) + 1 unit.
     * |        |          | CMR = 0: PWM low width = 2 x CNR + 1 unit; PWM high width = 1 unit.
     * |        |          |(Unit = one PWM clock cycle).
     * |        |          |Note: Any write to CMR will take effect in next PWM cycle.
     * @var BPWM_T::PDR1
     * Offset: 0x20  Basic PWM Data Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PDRx      |PWM Data Register
     * |        |          |User can monitor PDR to know the current value in 16-bit counter.
     * @var BPWM_T::PIER
     * Offset: 0x40  Basic PWM Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWMPIE0   |PWM Channel 0 Period Interrupt Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |PWMPIE1   |PWM Channel 1 Period Interrupt Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[8]     |PWMDIE0   |PWM Channel 0 Duty Interrupt Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |PWMDIE1   |PWM Channel 1 Duty Interrupt Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |INTTYPE   |PWM Interrupt Period Type Selection Bit
     * |        |          |0 = PWMIFn will be set if PWM counter underflow.
     * |        |          |1 = PWMIFn will be set if PWM counter matches CNRn register.
     * |        |          |Note: This bit is effective when BPWM in Center-aligned type only.
     * @var BPWM_T::PIIR
     * Offset: 0x44  Basic PWM Interrupt Indication Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWMIF0    |PWM Channel 0 Period Interrupt Status
     * |        |          |This bit is set by hardware when channel 0 counter reaches the requirement of interrupt (depend on INTTYPE bit of PIER register), software can write 1 to clear this bit to 0.
     * |[1]     |PWMIF1    |PWM Channel 1 Period Interrupt Status
     * |        |          |This bit is set by hardware when channel 1 counter reaches the requirement of interrupt (depend on INTTYPE bit of PIER register), software can write 1 to clear this bit to 0.
     * |[8]     |PWMDIF0   |PWM Channel 0 Duty Interrupt Flag
     * |        |          |Flag is set by hardware when channel 0 counter down count and reaches CMR0, software can clear this bit by writing a one to it.
     * |        |          |Note: If CMR equal to CNR, this flag is not working in Edge-aligned type selection.
     * |[9]     |PWMDIF1   |PWM Channel 1 Duty Interrupt Flag
     * |        |          |Flag is set by hardware when channel 1 counter down count and reaches CMR1, software can clear this bit by writing a one to it.
     * |        |          |Note: If CMR equal to CNR, this flag is not working in Edge-aligned type selection.
     * @var BPWM_T::CCR
     * Offset: 0x50  Basic PWM Capture Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |INV0      |Channel 0 Inverter Enable
     * |        |          |0 = Inverter disabled.
     * |        |          |1 = Inverter enabled. Reverse the input signal from GPIO before fed to capture timer.
     * |[1]     |CRL_IE0   |Channel 0 Rising Latch Interrupt Enable
     * |        |          |0 = Rising latch interrupt disabled.
     * |        |          |1 = Rising latch interrupt enabled.
     * |        |          |When enabled, if capture detects BPWM group channel 0 has rising transition, capture will issue an interrupt.
     * |[2]     |CFL_IE0   |Channel 0 Falling Latch Interrupt Enable
     * |        |          |0 = Falling latch interrupt disabled.
     * |        |          |1 = Falling latch interrupt enabled.
     * |        |          |When enabled, if capture detects BPWM group channel 0 has falling transition, capture will issue an interrupt.
     * |[3]     |CAPCH0EN  |Channel 0 Capture Function Enable
     * |        |          |0 = Capture function on BPWM group channel 0 disabled.
     * |        |          |1 = Capture function on BPWM group channel 0 enabled.
     * |        |          |When enabled, capture latched the PWM-counter value and saved to CRLR (Rising latch) and CFLR (Falling latch).
     * |        |          |When disabled, capture does not update CRLR and CFLR, and disable BPWM group channel 0 interrupt.
     * |[4]     |CAPIF0    |Channel 0 Capture Interrupt Indication Flag
     * |        |          |If BPWM channel 0 rising latch interrupt is enabled (CRL_IE0 = 1), a rising transition occurs at BPWM channel 0 will result in CAPIF0 to high; Similarly, a falling transition will cause CAPIF0 to be set high if BPWM channel 0 falling latch interrupt is enabled (CFL_IE0 = 1).
     * |        |          |Write 1 to clear this bit to 0.
     * |[6]     |CRLRI0    |CRLR0 Latched Indicator Bit
     * |        |          |When BPWM input channel 0 has a rising transition, CRLR0 was latched with the value of BPWM down-counter and this bit is set by hardware.
     * |        |          |Software can write 1 to clear this bit to 0.
     * |[7]     |CFLRI0    |CFLR0 Latched Indicator Bit
     * |        |          |When BPWM input channel 0 has a falling transition, CFLR0 was latched with the value of BPWM down-counter and this bit is set by hardware.
     * |        |          |Software can write 1 to clear this bit to 0.
     * |[16]    |INV1      |Channel 1 Inverter Enable
     * |        |          |0 = Inverter disabled.
     * |        |          |1 = Inverter enabled. Reverse the input signal from GPIO before fed to capture timer
     * |[17]    |CRL_IE1   |Channel 1 Rising Latch Interrupt Enable
     * |        |          |0 = Rising latch interrupt disabled.
     * |        |          |1 = Rising latch interrupt enabled.
     * |        |          |When enabled, if capture detects BPWM channel 1 has rising transition, capture will issue an interrupt.
     * |[18]    |CFL_IE1   |Channel 1 Falling Latch Interrupt Enable
     * |        |          |0 = Falling latch interrupt disabled.
     * |        |          |1 = Falling latch interrupt enabled.
     * |        |          |When enabled, if capture detects BPWM channel 1 has falling transition, capture will issue an interrupt.
     * |[19]    |CAPCH1EN  |Channel 1 Capture Function Enable
     * |        |          |0 = Capture function on BPWM channel 1 disabled.
     * |        |          |1 = Capture function on BPWM channel 1 enabled.
     * |        |          |When enabled, capture latched the BPWM-counter and saved to CRLR (Rising latch) and CFLR (Falling latch).
     * |        |          |When disabled, capture does not update CRLR and CFLR, and disable BPWM channel 1 interrupt.
     * |[20]    |CAPIF1    |Channel 1 Capture Interrupt Indication Flag
     * |        |          |If BPWM channel 1 rising latch interrupt is enabled (CRL_IE1 = 1), a rising transition occurs at BPWM channel 1 will result in CAPIF1 to high; Similarly, a falling transition will cause CAPIF1 to be set high if BPWM channel 1 falling latch interrupt is enabled (CFL_IE1 = 1).
     * |        |          |Write 1 to clear this bit to 0.
     * |[22]    |CRLRI1    |CRLR1 Latched Indicator Bit
     * |        |          |When BPWM input channel 1 has a rising transition, CRLR1 was latched with the value of BPWM down-counter and this bit is set by hardware.
     * |        |          |Software can write 1 to clear this bit to 0.
     * |[23]    |CFLRI1    |CFLR1 Latched Indicator Bit
     * |        |          |When BPWM input channel 1 has a falling transition, CFLR1 was latched with the value of BPWM down-counter and this bit is set by hardware.
     * |        |          |Software can write 1 to clear this bit to 0.
     * @var BPWM_T::CRLR0
     * Offset: 0x58  Basic PWM Capture Rising Latch Register (Channel 0)
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CRLRx     |Capture Rising Latch Register
     * |        |          |Latch the BPWM counter when channel 0/1 has rising transition.
     * @var BPWM_T::CFLR0
     * Offset: 0x5C  Basic PWM Capture Falling Latch Register (Channel 0)
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CFLRx     |Capture Falling Latch Register
     * |        |          |Latch the BPWM counter when channel 0/1 has falling transition.
     * @var BPWM_T::CRLR1
     * Offset: 0x60  Basic PWM Capture Rising Latch Register (Channel 1)
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CRLRx     |Capture Rising Latch Register
     * |        |          |Latch the BPWM counter when channel 0/1 has rising transition.
     * @var BPWM_T::CFLR1
     * Offset: 0x64  Basic PWM Capture Falling Latch Register (Channel 1)
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CFLRx     |Capture Falling Latch Register
     * |        |          |Latch the BPWM counter when channel 0/1 has falling transition.
     * @var BPWM_T::CAPENR
     * Offset: 0x78  Basic PWM Capture Input Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
