OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
     * | :----: | :----:   | :---- |
     * |[0]     |CINEN0    |Channel 0 Capture Input Enable
     * |        |          |0 = BPWM Channel 0 capture input path disabled.
     * |        |          |The input of BPWM channel 0 capture function is always regarded as 0.
     * |        |          |1 = BPWM Channel 0 capture input path enabled.
     * |        |          |The input of BPWM channel 0 capture function comes from correlative multifunction pin if GPIO multi-function is set as BPWM0_CH0.
     * |[1]     |CINEN1    |Channel 1 Capture Input Enable
     * |        |          |0 = BPWM Channel 1 capture input path disabled.
     * |        |          |The input of BPWM channel 1 capture function is always regarded as 0.
     * |        |          |1 = BPWM Channel 1 capture input path enabled.
     * |        |          |The input of BPWM channel 1 capture function comes from correlative multifunction pin if GPIO multi-function is set as BPWM0_CH1.
     * @var BPWM_T::POE
     * Offset: 0x7C  Basic PWM Output Enable
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |POE0      |Channel 0 Output Enable Register
     * |        |          |0 = BPWM channel 0 output to pin disabled.
     * |        |          |1 = BPWM channel 0 output to pin enabled.
     * |        |          |Note: The corresponding GPIO pin must also be switched to BPWM function
     * |[1]     |POE1      |Channel 1 Output Enable Register
     * |        |          |0 = BPWM channel 1 output to pin disabled.
     * |        |          |1 = BPWM channel 1 output to pin enabled.
     * |        |          |Note: The corresponding GPIO pin must also be switched to BPWM function
     */

    __IO uint32_t PPR;           /* Offset: 0x00  Basic PWM Prescaler Register                                       */
    __IO uint32_t CSR;           /* Offset: 0x04  Basic PWM Clock Source Divider Select Register                     */
    __IO uint32_t PCR;           /* Offset: 0x08  Basic PWM Control Register                                         */
    __IO uint32_t CNR0;          /* Offset: 0x0C  Basic PWM Counter Register 0                                       */
    __IO uint32_t CMR0;          /* Offset: 0x10  Basic PWM Comparator Register 0                                    */
    __I  uint32_t PDR0;          /* Offset: 0x14  Basic PWM Data Register 0                                          */
    __IO uint32_t CNR1;          /* Offset: 0x18  Basic PWM Counter Register 1                                       */
    __IO uint32_t CMR1;          /* Offset: 0x1C  Basic PWM Comparator Register 1                                    */
    __I  uint32_t PDR1;          /* Offset: 0x20  Basic PWM Data Register 1                                          */
    __I  uint32_t RESERVE0[7];
    __IO uint32_t PIER;          /* Offset: 0x40  Basic PWM Interrupt Enable Register                                */
    __IO uint32_t PIIR;          /* Offset: 0x44  Basic PWM Interrupt Indication Register                            */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t CCR;           /* Offset: 0x50  Basic PWM Capture Control Register                                 */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t CRLR0;         /* Offset: 0x58  Basic PWM Capture Rising Latch Register (Channel 0)                */
    __IO uint32_t CFLR0;         /* Offset: 0x5C  Basic PWM Capture Falling Latch Register (Channel 0)               */
    __IO uint32_t CRLR1;         /* Offset: 0x60  Basic PWM Capture Rising Latch Register (Channel 1)                */
    __IO uint32_t CFLR1;         /* Offset: 0x64  Basic PWM Capture Falling Latch Register (Channel 1)               */
    __I  uint32_t RESERVE3[4];
    __IO uint32_t CAPENR;        /* Offset: 0x78  Basic PWM Capture Input Enable Register                            */
    __IO uint32_t POE;           /* Offset: 0x7C  Basic PWM Output Enable                                            */

} BPWM_T;



/**
    @addtogroup BPWM_CONST BPWM Bit Field Definition
    Constant Definitions for BPWM Controller
@{ */

/* BPWM PPR Bit Field Definitions */
#define BPWM_PPR_DZI01_Pos                       16                                  /*!< BPWM_T::PPR: DZI01 Position */
#define BPWM_PPR_DZI01_Msk                       (0xFFul << BPWM_PPR_DZI01_Pos)      /*!< BPWM_T::PPR: DZI01 Mask */

#define BPWM_PPR_CP01_Pos                        0                                   /*!< BPWM_T::PPR: CP01 Position */
#define BPWM_PPR_CP01_Msk                        (0xFFul << BPWM_PPR_CP01_Pos)       /*!< BPWM_T::PPR: CP01 Mask */

/* BPWM CSR Bit Field Definitions */
#define BPWM_CSR_CSR1_Pos                        4                                   /*!< BPWM_T::CSR: CSR1 Position */
#define BPWM_CSR_CSR1_Msk                        (7ul << BPWM_CSR_CSR1_Pos)          /*!< BPWM_T::CSR: CSR1 Mask */

#define BPWM_CSR_CSR0_Pos                        0                                   /*!< BPWM_T::CSR: CSR0 Position */
#define BPWM_CSR_CSR0_Msk                        (7ul << BPWM_CSR_CSR0_Pos)          /*!< BPWM_T::CSR: CSR0 Mask */

/* BPWM PCR Bit Field Definitions */
#define BPWM_PCR_PWM01TYPE_Pos                   30                                  /*!< BPWM_T::PCR: PWM01TYPE Position */
#define BPWM_PCR_PWM01TYPE_Msk                   (1ul << BPWM_PCR_PWM01TYPE_Pos)     /*!< BPWM_T::PCR: PWM01TYPE Mask */

#define BPWM_PCR_CH1MOD_Pos                      11                                  /*!< BPWM_T::PCR: CH1MOD Position */
#define BPWM_PCR_CH1MOD_Msk                      (1ul << BPWM_PCR_CH1MOD_Pos)        /*!< BPWM_T::PCR: CH1MOD Mask */

#define BPWM_PCR_CH1INV_Pos                      10                                  /*!< BPWM_T::PCR: CH1INV Position */
#define BPWM_PCR_CH1INV_Msk                      (1ul << BPWM_PCR_CH1INV_Pos)        /*!< BPWM_T::PCR: CH1INV Mask */

#define BPWM_PCR_CH1PINV_Pos                     9                                   /*!< BPWM_T::PCR: CH1PINV Position */
#define BPWM_PCR_CH1PINV_Msk                     (1ul << BPWM_PCR_CH1PINV_Pos)       /*!< BPWM_T::PCR: CH1PINV Mask */

#define BPWM_PCR_CH1EN_Pos                       8                                   /*!< BPWM_T::PCR: CH1EN Position */
#define BPWM_PCR_CH1EN_Msk                       (1ul << BPWM_PCR_CH1EN_Pos)         /*!< BPWM_T::PCR: CH1EN Mask */

