OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
#define BPWM_PCR_DZEN01_Pos                      4                                   /*!< BPWM_T::PCR: DZEN01 Position */
#define BPWM_PCR_DZEN01_Msk                      (1ul << BPWM_PCR_DZEN01_Pos)        /*!< BPWM_T::PCR: DZEN01 Mask */

#define BPWM_PCR_CH0MOD_Pos                      3                                   /*!< BPWM_T::PCR: CH0MOD Position */
#define BPWM_PCR_CH0MOD_Msk                      (1ul << BPWM_PCR_CH0MOD_Pos)        /*!< BPWM_T::PCR: CH0MOD Mask */

#define BPWM_PCR_CH0INV_Pos                      2                                   /*!< BPWM_T::PCR: CH0INV Position */
#define BPWM_PCR_CH0INV_Msk                      (1ul << BPWM_PCR_CH0INV_Pos)        /*!< BPWM_T::PCR: CH0INV Mask */

#define BPWM_PCR_CH0PINV_Pos                     1                                   /*!< BPWM_T::PCR: CH0PINV Position */
#define BPWM_PCR_CH0PINV_Msk                     (1ul << BPWM_PCR_CH0PINV_Pos)       /*!< BPWM_T::PCR: CH0PINV Mask */

#define BPWM_PCR_CH0EN_Pos                       0                                   /*!< BPWM_T::PCR: CH0EN Position */
#define BPWM_PCR_CH0EN_Msk                       (1ul << BPWM_PCR_CH0EN_Pos)         /*!< BPWM_T::PCR: CH0EN Mask */

/* PWM CNR Bit Field Definitions */
#define BPWM_CNR_CNR_Pos                         0                                   /*!< BPWM_T::CNR: CNR Position */
#define BPWM_CNR_CNR_Msk                         (0xFFFFul << BPWM_CNR_CNR_Pos)      /*!< BPWM_T::CNR: CNR Mask */

/* PWM CMR Bit Field Definitions */
#define BPWM_CMR_CMR_Pos                         0                                   /*!< BPWM_T::CMR: CMR Position */
#define BPWM_CMR_CMR_Msk                         (0xFFFFul << BPWM_CMR_CMR_Pos)      /*!< BPWM_T::CMR: CMR Mask */

/* PWM PDR Bit Field Definitions */
#define BPWM_PDR_PDR_Pos                         0                                   /*!< BPWM_T::PDR: PDR Position */
#define BPWM_PDR_PDR_Msk                         (0xFFFFul << BPWM_PDR_PDR_Pos)      /*!< BPWM_T::PDR: PDR Mask */

/* PWM PIER Bit Field Definitions */
#define BPWM_PIER_INTTYPE_Pos                    16                                  /*!< BPWM_T::PIER: INTTYPE Position */
#define BPWM_PIER_INTTYPE_Msk                    (1ul << BPWM_PIER_INTTYPE_Pos)      /*!< BPWM_T::PIER: INTTYPE Mask */

#define BPWM_PIER_PWMDIE1_Pos                    9                                   /*!< BPWM_T::PIER: PWMDIE1 Position */
#define BPWM_PIER_PWMDIE1_Msk                    (1ul << BPWM_PIER_PWMDIE1_Pos)      /*!< BPWM_T::PIER: PWMDIE1 Mask */

#define BPWM_PIER_PWMDIE0_Pos                    8                                   /*!< BPWM_T::PIER: PWMDIE0 Position */
#define BPWM_PIER_PWMDIE0_Msk                    (1ul << BPWM_PIER_PWMDIE0_Pos)      /*!< BPWM_T::PIER: PWMDIE0 Mask */

#define BPWM_PIER_PWMPIE1_Pos                    1                                   /*!< BPWM_T::PIER: PWMPIE1 Position */
#define BPWM_PIER_PWMPIE1_Msk                    (1ul << BPWM_PIER_PWMPIE1_Pos)      /*!< BPWM_T::PIER: PWMPIE1 Mask */

#define BPWM_PIER_PWMPIE0_Pos                    0                                   /*!< BPWM_T::PIER: PWMPIE0 Position */
#define BPWM_PIER_PWMPIE0_Msk                    (1ul << BPWM_PIER_PWMPIE0_Pos)      /*!< BPWM_T::PIER: PWMPIE0 Mask */

/* PWM PIIR Bit Field Definitions */
#define BPWM_PIIR_PWMDIF1_Pos                    9                                   /*!< BPWM_T::PIIR: PWMDIF1 Position */
#define BPWM_PIIR_PWMDIF1_Msk                    (1ul << BPWM_PIIR_PWMDIF1_Pos)      /*!< BPWM_T::PIIR: PWMDIF1 Mask */

#define BPWM_PIIR_PWMDIF0_Pos                    8                                   /*!< BPWM_T::PIIR: PWMDIF0 Position */
#define BPWM_PIIR_PWMDIF0_Msk                    (1ul << BPWM_PIIR_PWMDIF0_Pos)      /*!< BPWM_T::PIIR: PWMDIF0 Mask */

#define BPWM_PIIR_PWMIF1_Pos                     1                                   /*!< BPWM_T::PIIR: PWMIF1 Position */
#define BPWM_PIIR_PWMIF1_Msk                     (1ul << BPWM_PIIR_PWMIF1_Pos)       /*!< BPWM_T::PIIR: PWMIF1 Mask */

#define BPWM_PIIR_PWMIF0_Pos                     0                                   /*!< BPWM_T::PIIR: PWMIF0 Position */
#define BPWM_PIIR_PWMIF0_Msk                     (1ul << BPWM_PIIR_PWMIF0_Pos)       /*!< BPWM_T::PIIR: PWMIF0 Mask */

/* PWM CCR Bit Field Definitions */
#define BPWM_CCR_CFLRI1_Pos                      23                                  /*!< BPWM_T::CCR: CFLRI1 Position */
#define BPWM_CCR_CFLRI1_Msk                      (1ul << BPWM_CCR_CFLRI1_Pos)        /*!< BPWM_T::CCR: CFLRI1 Mask */

#define BPWM_CCR_CRLRI1_Pos                      22                                  /*!< BPWM_T::CCR: CRLRI1 Position */
#define BPWM_CCR_CRLRI1_Msk                      (1ul << BPWM_CCR_CRLRI1_Pos)        /*!< BPWM_T::CCR: CRLRI1 Mask */

#define BPWM_CCR_CAPIF1_Pos                      20                                  /*!< BPWM_T::CCR: CAPIF1 Position */
#define BPWM_CCR_CAPIF1_Msk                      (1ul << BPWM_CCR_CAPIF1_Pos)        /*!< BPWM_T::CCR: CAPIF1 Mask */

#define BPWM_CCR_CAPCH1EN_Pos                    19                                  /*!< BPWM_T::CCR: CAPCH1EN Position */
#define BPWM_CCR_CAPCH1EN_Msk                    (1ul << BPWM_CCR_CAPCH1EN_Pos)      /*!< BPWM_T::CCR: CAPCH1EN Mask */

#define BPWM_CCR_CFL_IE1_Pos                     18                                  /*!< BPWM_T::CCR: CFL_IE1 Position */
#define BPWM_CCR_CFL_IE1_Msk                     (1ul << BPWM_CCR_CFL_IE1_Pos)       /*!< BPWM_T::CCR: CFL_IE1 Mask */

#define BPWM_CCR_CRL_IE1_Pos                     17                                  /*!< BPWM_T::CCR: CRL_IE1 Position */
#define BPWM_CCR_CRL_IE1_Msk                     (1ul << BPWM_CCR_CRL_IE1_Pos)       /*!< BPWM_T::CCR: CRL_IE1 Mask */

#define BPWM_CCR_INV1_Pos                        16                                  /*!< BPWM_T::CCR: INV1 Position */
#define BPWM_CCR_INV1_Msk                        (1ul << BPWM_CCR_INV1_Pos)          /*!< BPWM_T::CCR: INV1 Mask */

#define BPWM_CCR_CFLRI0_Pos                      7                                   /*!< BPWM_T::CCR: CFLRI0 Position */
#define BPWM_CCR_CFLRI0_Msk                      (1ul << BPWM_CCR_CFLRI0_Pos)        /*!< BPWM_T::CCR: CFLRI0 Mask */

#define BPWM_CCR_CRLRI0_Pos                      6                                   /*!< BPWM_T::CCR: CRLRI0 Position */
#define BPWM_CCR_CRLRI0_Msk                      (1ul << BPWM_CCR_CRLRI0_Pos)        /*!< BPWM_T::CCR: CRLRI0 Mask */

#define BPWM_CCR_CAPIF0_Pos                      4                                   /*!< BPWM_T::CCR: CAPIF0 Position */
#define BPWM_CCR_CAPIF0_Msk                      (1ul << BPWM_CCR_CAPIF0_Pos)        /*!< BPWM_T::CCR: CAPIF0 Mask */

#define BPWM_CCR_CAPCH0EN_Pos                    3                                   /*!< BPWM_T::CCR: CAPCH0EN Position */
#define BPWM_CCR_CAPCH0EN_Msk                    (1ul << BPWM_CCR_CAPCH0EN_Pos)      /*!< BPWM_T::CCR: CAPCH0EN Mask */

