OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
#define CLK_CLKDIV_HCLK_N_Pos                0                                        /*!< CLK_T::CLKDIV: HCLK_N Position */
#define CLK_CLKDIV_HCLK_N_Msk                (0xFul << CLK_CLKDIV_HCLK_N_Pos)         /*!< CLK_T::CLKDIV: HCLK_N Mask */

/* CLK PLLCON Bit Field Definitions */
#define CLK_PLLCON_FCO_SEL_Pos               20                                       /*!< CLK_T::PLLCON: FCO_SEL Position */
#define CLK_PLLCON_FCO_SEL_Msk               (1ul << CLK_PLLCON_FCO_SEL_Pos)          /*!< CLK_T::PLLCON: FCO_SEL Mask */

#define CLK_PLLCON_PLL_SRC_Pos               19                                       /*!< CLK_T::PLLCON: PLL_SRC Position */
#define CLK_PLLCON_PLL_SRC_Msk               (1ul << CLK_PLLCON_PLL_SRC_Pos)          /*!< CLK_T::PLLCON: PLL_SRC Mask */

#define CLK_PLLCON_OE_Pos                    18                                       /*!< CLK_T::PLLCON: OE Position */
#define CLK_PLLCON_OE_Msk                    (1ul << CLK_PLLCON_OE_Pos)               /*!< CLK_T::PLLCON: OE Mask */

#define CLK_PLLCON_BP_Pos                    17                                       /*!< CLK_T::PLLCON: BP Position */
#define CLK_PLLCON_BP_Msk                    (1ul << CLK_PLLCON_BP_Pos)               /*!< CLK_T::PLLCON: BP Mask */

#define CLK_PLLCON_PD_Pos                    16                                       /*!< CLK_T::PLLCON: PD Position */
#define CLK_PLLCON_PD_Msk                    (1ul << CLK_PLLCON_PD_Pos)               /*!< CLK_T::PLLCON: PD Mask */

#define CLK_PLLCON_OUT_DV_Pos                14                                       /*!< CLK_T::PLLCON: OUT_DV Position */
#define CLK_PLLCON_OUT_DV_Msk                (3ul << CLK_PLLCON_OUT_DV_Pos)           /*!< CLK_T::PLLCON: OUT_DV Mask */

#define CLK_PLLCON_IN_DV_Pos                 9                                        /*!< CLK_T::PLLCON: IN_DV Position */
#define CLK_PLLCON_IN_DV_Msk                 (0x1Ful << CLK_PLLCON_IN_DV_Pos)         /*!< CLK_T::PLLCON: IN_DV Mask */

#define CLK_PLLCON_FB_DV_Pos                 0                                        /*!< CLK_T::PLLCON: FB_DV Position */
#define CLK_PLLCON_FB_DV_Msk                 (0x1FFul << CLK_PLLCON_FB_DV_Pos)        /*!< CLK_T::PLLCON: FB_DV Mask */

/* CLK FRQDIV Bit Field Definitions */
#define CLK_FRQDIV_DIV1_Pos                  5                                        /*!< CLK_T::FRQDIV: DIV1 Position */
#define CLK_FRQDIV_DIV1_Msk                  (1ul << CLK_FRQDIV_DIV1_Pos)             /*!< CLK_T::FRQDIV: DIV1 Mask */

#define CLK_FRQDIV_DIVIDER_EN_Pos            4                                        /*!< CLK_T::FRQDIV: DIVIDER_EN Position */
#define CLK_FRQDIV_DIVIDER_EN_Msk            (1ul << CLK_FRQDIV_DIVIDER_EN_Pos)       /*!< CLK_T::FRQDIV: DIVIDER_EN Mask */

#define CLK_FRQDIV_FSEL_Pos                  0                                        /*!< CLK_T::FRQDIV: FSEL Position */
#define CLK_FRQDIV_FSEL_Msk                  (0xFul << CLK_FRQDIV_FSEL_Pos)           /*!< CLK_T::FRQDIV: FSEL Mask */

/* CLK CLKDCR Bit Field Definitions */
#define CLK_CLKDCR_CKD_IEN_Pos               1                                        /*!< CLK_T::CLKDCR: CKD_IEN Position */
#define CLK_CLKDCR_CKD_IEN_Msk               (1ul << CLK_CLKDCR_CKD_IEN_Pos)          /*!< CLK_T::CLKDCR: CKD_IEN Mask */

#define CLK_CLKDCR_CKD_EN_Pos                0                                        /*!< CLK_T::CLKDCR: CKD_EN Position */
#define CLK_CLKDCR_CKD_EN_Msk                (1ul << CLK_CLKDCR_CKD_EN_Pos)           /*!< CLK_T::CLKDCR: CKD_EN Mask */

/* CLK CLKDSR Bit Field Definitions */
#define CLK_CLKDSR_CKSTOP_Pos                1                                        /*!< CLK_T::CLKDSR: CKSTOP Position */
#define CLK_CLKDSR_CKSTOP_Msk                (1ul << CLK_CLKDSR_CKSTOP_Pos)           /*!< CLK_T::CLKDSR: CKSTOP Mask */

#define CLK_CLKDSR_CKSTOP_IF_Pos             0                                        /*!< CLK_T::CLKDSR: CKSTOP_IF Position */
#define CLK_CLKDSR_CKSTOP_IF_Msk             (1ul << CLK_CLKDSR_CKSTOP_IF_Pos)        /*!< CLK_T::CLKDSR: CKSTOP_IF Mask */

/*@}*/ /* end of group CLK_CONST */
/*@}*/ /* end of group CLK */


/*----------------------------- EADC Controller -------------------------------*/
/** @addtogroup EADC Enhanced Analog to Digital Converter (EADC)
  Memory Mapped Structure for EADC Controller
  @{
 */

typedef struct
{


    /**
     * @var EADC_T::ADDRA[8]
     * Offset: 0x00~0x1C  A/D Data Register n for SAMPLEAn, n=0~7
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |RSLT      |A/D Conversion Result
     * |        |          |This field contains 12-bit conversion result.
     * |[16]    |OVERRUN   |Overrun Flag
     * |        |          |0 = Data in RSLT[11:0] is the recent conversion result.
     * |        |          |1 = Data in RSLT[11:0] is overwritten.
     * |        |          |If converted data in RSLT[11:0] has not been read before new conversion result is loaded to
     * |        |          |this register, OVERRUN is set to 1. It is cleared by hardware after ADDR register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RSLT[11:0] bits is not valid.
     * |        |          |1 = Data in RSLT[11:0] bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed
     * |        |          |and cleared by hardware after ADDR register is read.
     * @var EADC_T::ADDRB[8]
     * Offset: 0x20~0x3C  A/D Data Register m for SAMPLEAn, m=8~15, n=0~7
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |RSLT      |A/D Conversion Result
     * |        |          |This field contains 12-bit conversion result.
     * |[16]    |OVERRUN   |Overrun Flag
     * |        |          |0 = Data in RSLT[11:0] is the recent conversion result.
     * |        |          |1 = Data in RSLT[11:0] is overwritten.
     * |        |          |If converted data in RSLT[11:0] has not been read before new conversion result is loaded to
     * |        |          |this register, OVERRUN is set to 1. It is cleared by hardware after ADDR register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RSLT[11:0] bits is not valid.
     * |        |          |1 = Data in RSLT[11:0] bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed
     * |        |          |and cleared by hardware after ADDR register is read.
     * @var EADC_T::ADCR
     * Offset: 0x40  EADC Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AD_EN     |A/D Converter Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |        |          |Before starting A/D conversion function, this bit should be set to 1.
     * |        |          |Clear it to 0 to disable A/D converter analog circuit for saving power consumption.
     * |[1]     |ADRESET   |EADCA, EADCB A/D Converter Control Circuits Reset
     * |        |          |0 = Writing 0 has no effect.
     * |        |          |1 = Writing 1 will cause EADC control circuits reset to initial state, but not change the EADC registers value.
     * |        |          |ADRESET bit remains 1 during EADC reset, when EADC reset end, the ADRESET bit is automatically cleared to 0.
     * |[2]     |ADIE0     |Specific SAMPLE A/D ADINT0 Interrupt Enable
     * |        |          |0 = Specific SAMPLE A/D ADINT0 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT0 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADF0 flag in ADSR1 register upon the end of
     * |        |          |specific SAMPLE A/D conversion. If ADIE0 bit is set then conversion end interrupt request
     * |        |          |ADINT0 is generated.
     * |[3]     |ADIE1     |Specific SAMPLE A/D ADINT1 Interrupt Enable
     * |        |          |0 = Specific SAMPLE A/D ADINT1 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT1 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADF1 flag in ADSR1 register upon the end of
     * |        |          |specific SAMPLE A/D conversion. If ADIE1 bit is set then conversion end interrupt request
     * |        |          |ADINT1 is generated.
     * |[4]     |ADIE2     |Specific SAMPLE A/D ADINT2 Interrupt Enable
     * |        |          |0 = Specific SAMPLE A/D ADINT2 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT2 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADF2 flag in ADSR1 register upon the end of
     * |        |          |specific SAMPLE A/D conversion. If ADIE2 bit is set then conversion end interrupt request
     * |        |          |ADINT2 is generated.
     * |[5]     |ADIE3     |Specific SAMPLE A/D ADINT3 Interrupt Enable
     * |        |          |0 = Specific SAMPLE A/D ADINT3 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT3 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADF3 flag in ADSR1 register upon the end of
     * |        |          |specific SAMPLE A/D conversion. If ADIE3 bit is set then conversion end interrupt request
     * |        |          |ADINT3 is generated.
     * @var EADC_T::ADCHISELR
     * Offset: 0x44  A/D Channel Input Sources Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AINA0SEL  |A/D Channel AINA[0] Analog Input Selection
     * |        |          |0 = AINA[0] pin P6.0/AINA0 is selected as the EADC AINA[0] input signal.
     * |        |          |1 = OP Amplifier 0 output  is selected as the EADC AINA[0] input signal.
     * |[1]     |AINB0SEL  |A/D Channel AINB[0] Analog Input Selection
     * |        |          |0 = AINB[0] pin P7.0/AINB0 is selected as the A/D AINB[0] input signal.
     * |        |          |1 = OP Amplifier 1 output  is selected as the A/D AINB[0] input signal.
     * |[3:2]   |PRESEL    |A/D Channel AINA[7] Analog Input Selection
     * |        |          |00 = Analog Input Channel AINA7.
     * |        |          |01 = Band-gap (VBG) Analog Input.
     * |        |          |10 = VTEMP Internal Temperature Sensor Analog Input.
     * |        |          |11 = Analog ground.
     * @var EADC_T::ADSSTR
     * Offset: 0x48  A/D SAMPLE Software Start Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |ADST[7:0] |A/D SAMPLEA7~0 Software Force To Start EADC Conversion Register
     * |        |          |0 = No effect.
     * |        |          |1 = Cause an EADC conversion when the priority is given to SAMPLEA.
     * |[15:8]  |ADST[15:8]|A/D SAMPLEB7~0 Software Force To Start EADC Conversion Register
     * |        |          |0 = No effect.
     * |        |          |1 = Cause an EADC conversion when the priority is given to SAMPLEB.
     * @var EADC_T::ADSTPFR
     * Offset: 0x4C  A/D SAMPLE Start of Conversion Pending Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |STPF[7:0] |A/D SAMPLEA7~0 Start Conversion Pending Flag
     * |        |          |0 = 0 = There is no pending conversion for SAMPLEA.
     * |        |          |1 = SAMPLEA EADC start of conversion is pending.
     * |        |          |This bit remains 1 during pending state, when the respective EADC conversion is started, the
     * |        |          |STPFx bit is automatically cleared to 0.
     * |[15:8]  |STPF[15:8]|A/D SAMPLEB7~0 Software Force To Start EADC Conversion Register
     * |        |          |0 = No pending conversion for SAMPLEB.
     * |        |          |1 = SAMPLEB EADC start of conversion is pending.
     * |        |          |This bit remains 1 during pending state, when the respective EADC conversion is started, the
     * |        |          |STPFx bit is automatically cleared to 0.
     * @var EADC_T::ADIFOVR
     * Offset: 0x50  A/D ADINT3~0 Interrupt Flag Over Run Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADFOV0    |A/D ADINT0 Interrupt Flag Over Run Bit
     * |        |          |0 = ADINT0 interrupt flag is not over run.
     * |        |          |1 = ADINT0 interrupt flag is overwrite to 1.
     * |        |          |It is cleared by write 1.
     * |[1]     |ADFOV1    |A/D ADINT1 Interrupt Flag Over Run Bit
     * |        |          |0 = ADINT1 interrupt flag is not over run.
     * |        |          |1 = ADINT1 interrupt flag is overwrite to 1.
     * |        |          |It is cleared by write 1.
     * |[2]     |ADFOV2    |A/D ADINT2 Interrupt Flag Over Run Bit
     * |        |          |0 = ADINT2 interrupt flag is not over run.
     * |        |          |1 = ADINT2 interrupt flag is overwrite to 1.
     * |        |          |It is cleared by write 1.
     * |[3]     |ADFOV3    |A/D ADINT3 Interrupt Flag Over Run Bit
     * |        |          |0 = ADINT3 interrupt flag is not over run.
     * |        |          |1 = ADINT3 interrupt flag is overwrite to 1.
     * |        |          |It is cleared by write 1.
     * @var EADC_T::ADSPOVFR
     * Offset: 0x54  A/D SAMPLE Start of Conversion Over Run Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field      |Descriptions
     * | :----: | :----:    | :---- |
     * |[7:0]   |SPOVF[7:0] |A/D SAMPLEA7~0 Start Conversion Over Run Flag
     * |        |           |0 = No SAMPLE event over run.
     * |        |           |1 = A new SAMPLEA event is generated while an old one event is pending.
     * |        |           |It is cleared by writing 1.
     * |[15:8]  |SPOVF[15:8]|A/D SAMPLEB7~0 Start Conversion Over Run Flag
     * |        |           |0 = No SAMPLE event over run.
     * |        |           |1 = A new SAMPLEB event is generated while an old one event is pending.
     * |        |           |It is cleared by writing 1.
     * @var EADC_T::ADSPCRA[8]
     * Offset: 0x58~0x64 ADSPCRA0~3 A/D SAMPLEAn Control Register, n=0~3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |CHSEL     |A/D SAMPLEA Channel Selection
     * |        |          |00H = EADC0_CH0.
     * |        |          |01H = EADC0_CH1.
     * |        |          |02H = EADC0_CH2.
     * |        |          |03H = EADC0_CH3.
     * |        |          |04H = EADC0_CH4.
     * |        |          |05H = EADC0_CH5.
     * |        |          |06H = EADC0_CH6.
     * |        |          |07H = EADC0_CH7.
     * |[7:4]   |TRGSEL    |A/D SAMPLE Start Conversion Trigger Source Selection
     * |        |          |0H = Disable hardware trigger.
     * |        |          |1H = External trigger from STADC pin input.
     * |        |          |2H = EADC ADINT0 interrupt EOC pulse  trigger.
     * |        |          |3H = EADC ADINT1 interrupt EOC pulse  trigger.
     * |        |          |4H = Timer0 overflow pulse trigger.
     * |        |          |5H = Timer1 overflow pulse trigger.
     * |        |          |6H = Timer2 overflow pulse trigger.
     * |        |          |7H = Timer3 overflow pulse trigger.
     * |        |          |8H = EPWM00 trigger.
     * |        |          |9H = EPWM02 trigger.
     * |        |          |AH = EPWM04 trigger.
     * |        |          |BH = EPWM10 trigger.
     * |        |          |CH = EPWM12 trigger.
     * |        |          |DH = EPWM14 trigger.
     * |        |          |EH = BPWM00 trigger.
     * |        |          |FH = BPWM01 trigger.
     * |[15:8]  |TRGDLYCNT |A/D SAMPLE Start Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[17:16] |TRGDLYDIV |A/D SAMPLE Start Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = EADC_CLK/1.
     * |        |          |01 = EADC_CLK/2.
     * |        |          |10 = EADC_CLK/4.
     * |        |          |11 = EADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Trigger Rising Edge Enabled
     * |        |          |0 = Rising edge Disabled when A/D selects STADC as trigger source.
     * |        |          |1 = Rising edge Enabled when A/D selects STADC as trigger source.
     * |[21]    |EXTFEN    |A/D External Trigger Falling Edge Enabled
     * |        |          |0 = Falling edge Disabled when A/D selects STADC as trigger source.
     * |        |          |1 = Falling edge Enabled when A/D selects STADC as trigger source.
     * Offset: 0x68~0x74 ADSPCRA4~7 A/D SAMPLEAn Control Register, n=4~7
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |CHSEL     |A/D SAMPLEA Channel Selection
     * |        |          |00H = EADC0_CH0.
     * |        |          |01H = EADC0_CH1.
     * |        |          |02H = EADC0_CH2.
     * |        |          |03H = EADC0_CH3.
     * |        |          |04H = EADC0_CH4.
     * |        |          |05H = EADC0_CH5.
     * |        |          |06H = EADC0_CH6.
     * |        |          |07H = EADC0_CH7.
     * |[6:4]   |TRGSEL    |A/D SAMPLE Start Conversion Trigger Source Selection
     * |        |          |0H = Disable hardware trigger.
     * |        |          |1H = External trigger from STADC pin input.
     * |        |          |2H = EADC ADINT0 interrupt EOC pulse  trigger.
     * |        |          |3H = EADC ADINT1 interrupt EOC pulse  trigger.
     * |        |          |4H = Timer0 overflow pulse trigger.
     * |        |          |5H = Timer1 overflow pulse trigger.
     * |        |          |6H = Timer2 overflow pulse trigger.
     * |        |          |7H = Timer3 overflow pulse trigger.
     * |[20]    |EXTREN    |A/D External Trigger Rising Edge Enabled
     * |        |          |0 = Rising edge Disabled when A/D selects STADC as trigger source.
     * |        |          |1 = Rising edge Enabled when A/D selects STADC as trigger source.
     * |[21]    |EXTFEN    |A/D External Trigger Falling Edge Enabled
     * |        |          |0 = Falling edge Disabled when A/D selects STADC as trigger source.
     * |        |          |1 = Falling edge Enabled when A/D selects STADC as trigger source.
     * @var EADC_T::ADSPCRB[8]
     * Offset: 0x78~0x84 ADSPCRB0~3 A/D SAMPLEBn Control Register, n=0~3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |CHSEL     |A/D SAMPLEB Channel Selection
     * |        |          |00H = EADC1_CH0.
     * |        |          |01H = EADC1_CH1.
     * |        |          |02H = EADC1_CH2.
     * |        |          |03H = EADC1_CH3.
     * |        |          |04H = EADC1_CH4.
     * |        |          |05H = EADC1_CH5.
     * |        |          |06H = EADC1_CH6.
     * |        |          |07H = EADC1_CH7.
     * |[7:4]   |TRGSEL    |A/D SAMPLE Start Conversion Trigger Source Selection
     * |        |          |0H = Disable hardware trigger.
     * |        |          |1H = External trigger from STADC pin input.
     * |        |          |2H = EADC ADINT0 interrupt EOC pulse  trigger.
     * |        |          |3H = EADC ADINT1 interrupt EOC pulse  trigger.
     * |        |          |4H = Timer0 overflow pulse trigger.
     * |        |          |5H = Timer1 overflow pulse trigger.
     * |        |          |6H = Timer2 overflow pulse trigger.
     * |        |          |7H = Timer3 overflow pulse trigger.
     * |        |          |8H = EPWM00 trigger.
     * |        |          |9H = EPWM02 trigger.
     * |        |          |AH = EPWM04 trigger.
     * |        |          |BH = EPWM10 trigger.
     * |        |          |CH = EPWM12 trigger.
     * |        |          |DH = EPWM14 trigger.
     * |        |          |EH = BPWM00 trigger.
     * |        |          |FH = BPWM01 trigger.
     * |[15:8]  |TRGDLYCNT |A/D SAMPLE Start Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[17:16] |TRGDLYDIV |A/D SAMPLE Start Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = EADC_CLK/1.
     * |        |          |01 = EADC_CLK/2.
     * |        |          |10 = EADC_CLK/4.
     * |        |          |11 = EADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Trigger Rising Edge Enabled
     * |        |          |0 = Rising edge Disabled when A/D selects STADC as trigger source.
     * |        |          |1 = Rising edge Enabled when A/D selects STADC as trigger source.
     * |[21]    |EXTFEN    |A/D External Trigger Falling Edge Enabled
     * |        |          |0 = Falling edge Disabled when A/D selects STADC as trigger source.
     * |        |          |1 = Falling edge Enabled when A/D selects STADC as trigger source.
     * Offset: 0x88~0x94 ADSPCRB4~7 A/D SAMPLEBn Control Register, n=4~7
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |CHSEL     |A/D SAMPLEB Channel Selection
     * |        |          |00H = EADC1_CH0.
     * |        |          |01H = EADC1_CH1.
     * |        |          |02H = EADC1_CH2.
     * |        |          |03H = EADC1_CH3.
     * |        |          |04H = EADC1_CH4.
     * |        |          |05H = EADC1_CH5.
     * |        |          |06H = EADC1_CH6.
     * |        |          |07H = EADC1_CH7.
     * |[6:4]   |TRGSEL    |A/D SAMPLE Start Conversion Trigger Source Selection
     * |        |          |0H = Disable hardware trigger.
     * |        |          |1H = External trigger from STADC pin input.
     * |        |          |2H = EADC ADINT0 interrupt EOC pulse  trigger.
     * |        |          |3H = EADC ADINT1 interrupt EOC pulse  trigger.
     * |        |          |4H = Timer0 overflow pulse trigger.
     * |        |          |5H = Timer1 overflow pulse trigger.
     * |        |          |6H = Timer2 overflow pulse trigger.
     * |        |          |7H = Timer3 overflow pulse trigger.
     * |[20]    |EXTREN    |A/D External Trigger Rising Edge Enabled
     * |        |          |0 = Rising edge Disabled when A/D selects STADC as trigger source.
