OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
     * |        |          |1 = Rising edge Enabled when A/D selects STADC as trigger source.
     * |[21]    |EXTFEN    |A/D External Trigger Falling Edge Enabled
     * |        |          |0 = Falling edge Disabled when A/D selects STADC as trigger source.
     * |        |          |1 = Falling edge Enabled when A/D selects STADC as trigger source.
     * @var EADC_T::ADSMSELR
     * Offset: 0xA4  A/D SAMPLE Simultaneous Mode Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SIMUSEL0  |A/D SAMPLEA0, SAMPLEB0 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA0, SAMPLEB0 are in single sampling mode, both SAMPLEA0 and
     * |        |          |SAMPLEB0's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA0, SAMPLEB0 are in simultaneous sampling mode, Only SAMPLEA0 can
     * |        |          |trigger both the EADC conversions of SAMPLEA0 and SAMPLEB0, SAMPLEB0.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA0's CHSEL = 1, and SAMPLEB0's CHSEL = 3, the
     * |        |          |pair of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * |[1]     |SIMUSEL1  |A/D SAMPLEA1, SAMPLEB1 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA1, SAMPLEB1 are in single sampling mode, both SAMPLEA1 and
     * |        |          |SAMPLEB1's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA1, SAMPLEB1 are in simultaneous sampling mode, Only SAMPLEA1 can
     * |        |          |trigger both the EADC conversions of SAMPLEA1 and SAMPLEB1, SAMPLEB1.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA1's CHSEL = 1, and SAMPLEB1's CHSEL = 3, the
     * |        |          |pair of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * |[2]     |SIMUSEL2  |A/D SAMPLEA2, SAMPLEB2 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA2, SAMPLEB2 are in single sampling mode, both SAMPLEA2 and
     * |        |          |SAMPLEB2's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA2, SAMPLEB2 are in simultaneous sampling mode, Only SAMPLEA2 can
     * |        |          |trigger both the EADC conversions of SAMPLEA2 and SAMPLEB2, SAMPLEB2.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA2's CHSEL = 1, and SAMPLEB2's CHSEL = 3, the
     * |        |          |pair of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * |[3]     |SIMUSEL3  |A/D SAMPLEA3, SAMPLEB3 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA3, SAMPLEB3 are in single sampling mode, both SAMPLEA3 and
     * |        |          |SAMPLEB3's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA3, SAMPLEB3 are in simultaneous sampling mode, Only SAMPLEA3 can
     * |        |          |trigger both the EADC conversions of SAMPLEA3 and SAMPLEB3, SAMPLEB3.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA3's CHSEL = 1, and SAMPLEB3's CHSEL = 3, the
     * |        |          |pair of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * |[4]     |SIMUSEL4  |A/D SAMPLEA4, SAMPLEB4 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA4, SAMPLEB4 are in single sampling mode, both SAMPLEA4 and
     * |        |          |SAMPLEB4's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA4, SAMPLEB4 are in simultaneous sampling mode, Only SAMPLEA4 can
     * |        |          |trigger both the EADC conversions of SAMPLEA4 and SAMPLEB4, SAMPLEB4.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA4's CHSEL = 1, and SAMPLEB4's CHSEL = 3, the
     * |        |          |pair of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * |[5]     |SIMUSEL5  |A/D SAMPLEA5, SAMPLEB5 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA5, SAMPLEB5 are in single sampling mode, both SAMPLEA5 and
     * |        |          |SAMPLEB5's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA5, SAMPLEB5 are in simultaneous sampling mode, Only SAMPLEA5 can
     * |        |          |trigger both the EADC conversions of SAMPLEA5 and SAMPLEB5, SAMPLEB5.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA5's CHSEL = 1, and SAMPLEB5's CHSEL = 3, the
     * |        |          |pair of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * |[6]     |SIMUSEL6  |A/D SAMPLEA6, SAMPLEB6 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA6, SAMPLEB6 are in single sampling mode, both SAMPLEA6 and
     * |        |          |SAMPLEB6's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA6, SAMPLEB6 are in simultaneous sampling mode, Only SAMPLEA6 can
     * |        |          |trigger both the EADC conversions of SAMPLEA6 and SAMPLEB6, SAMPLEB6.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA6's CHSEL = 1, and SAMPLEB6's CHSEL = 3, the
     * |        |          |pair of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * |[7]     |SIMUSEL7  |A/D SAMPLEA7, SAMPLEB7 Simultaneous Sampling Mode Selection
     * |        |          |0 = SAMPLEA7, SAMPLEB7 are in single sampling mode, both SAMPLEA7 and
     * |        |          |SAMPLEB7's 3 bits of CHSEL define the ADC channels to be converted.
     * |        |          |1 = SAMPLEA7, SAMPLEB7 are in simultaneous sampling mode, Only SAMPLEA7 can
     * |        |          |trigger both the EADC conversions of SAMPLEA7 and SAMPLEB7, SAMPLEB7.trigger
     * |        |          |select TRGSEL is ignored. if SAMPLEA7's CHSEL = 1, SAMPLEB7's CHSEL = 3, the pair
     * |        |          |of channels are AINA[1], AINB[3], they will do the EADC conversion at the same time.
     * @var EADC_T::ADCMPR[2]
     * Offset: 0xA8~0xAC  A/D Result Compare Register 0/1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADCMP_EN  |A/D Result Compare Enable
     * |        |          |0 = Compare Disabled.
     * |        |          |1 = Compare Enabled.
     * |        |          |Set this bit to 1 to enable compare CMPD[11:0] with specified SAMPLE conversion result
     * |        |          |when converted data is loaded into ADDR register.
     * |[1]     |ADCMPIE   |A/D Result Compare Interrupt Enable
     * |        |          |0 = Compare function interrupt Disabled.
     * |        |          |1 = Compare function interrupt Enabled.
     * |        |          |If the compare function is enabled and the compare condition matches the setting of
     * |        |          |CMPCOND and CMPMATCNT, ADCMPF bit will be asserted, in the meanwhile, if
     * |        |          |ADCMPIE is set to 1, a compare interrupt request is generated.
     * |[2]     |CMPCOND   |Compare Condition
     * |        |          |0= Set the compare condition as that when a 12-bit A/D conversion result is less than the
     * |        |          |12-bit CMPD (ADCMPRx[27:16]), the internal match counter will increase one.
     * |        |          |1= Set the compare condition as that when a 12-bit A/D conversion result is greater or
     * |        |          |equal to the 12-bit CMPD (ADCMPRx[27:16]), the internal match counter will increase
     * |        |          |one.
     * |        |          |Note: When the internal counter reaches the value to (CMPMATCNT +1), the CMPF bit
     * |        |          |will be set.
     * |[5:3]   |CMPSMPL   |Compare SAMPLE Selection
     * |        |          |000 = SAMPLEA0 conversion result ADDRA0 is selected to be compared.
     * |        |          |001 = SAMPLEA1 conversion result ADDRA1 is selected to be compared.
     * |        |          |010 = SAMPLEA2 conversion result ADDRA2 is selected to be compared.
     * |        |          |011 = SAMPLEA3 conversion result ADDRA3 is selected to be compared.
     * |        |          |100 = SAMPLEB0 conversion result ADDRB0 is selected to be compared.
     * |        |          |101 = SAMPLEB1 conversion result ADDRB1 is selected to be compared.
     * |        |          |110 = SAMPLEB2 conversion result ADDRB2 is selected to be compared.
     * |        |          |111 = SAMPLEB3 conversion result ADDRB3 is selected to be compared.
     * |[11:8]  |CMPMATCNT |Compare Match Count
     * |        |          |When the specified A/D SAMPLE analog conversion result matches the compare
     * |        |          |condition defined by CMPCOND, the internal match counter will increase 1. When the
     * |        |          |internal counter reaches the value to (CMPMATCNT +1), the CMPF bit will be set.
     * |[27:16] |CMPD      |Comparison Data
     * |        |          |The 12 bits data is used to compare with the conversion result of specified SAMPLE.
     * |        |          |Software can use it to monitor the external analog input pin voltage transition without
     * |        |          |imposing a load on software.
     * @var EADC_T::ADSR0
     * Offset: 0xB0  A/D Status Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |VALID     |ADDRA7~0 Data Valid Flag
     * |        |          |It is a mirror of VALID bit in SAMPLEA A/D result data register ADDRAn, n=0~7.
     * |[15:8]  |VALID     |ADDRB7~0 Data Valid Flag
     * |        |          |It is a mirror of VALID bit in SAMPLEB A/D result data register ADDRBn, n=0~7.
     * |[23:16] |OV        |ADDRA7~0 Over Run Flag
     * |        |          |It is a mirror to OVERRUN bit in SAMPLEA A/D result data register ADDRAn, n=0~7.
     * |[31:24] |OV        |ADDRB7~0 Over Run Flag
     * |        |          |It is a mirror to OVERRUN bit in SAMPLEB A/D result data register ADDRBn, n=0~7.
     * @var EADC_T::ADSR1
     * Offset: 0xB4  A/D Status Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADF0      |A/D ADINT0 Interrupt Flag
     * |        |          |0 = No ADINT0 interrupt pulse received.
     * |        |          |1 = ADINT0 interrupt pulse received.
     * |        |          |It is cleared by writing 1.
     * |        |          |This bit indicates whether an A/D conversion of specific SAMPLE has been completed.
     * |[1]     |ADF1      |A/D ADINT1 Interrupt Flag
     * |        |          |0 = No ADINT1 interrupt pulse received.
     * |        |          |1 = ADINT1 interrupt pulse received.
     * |        |          |It is cleared by writing 1.
     * |        |          |This bit indicates whether an A/D conversion of specific SAMPLE has been completed.
     * |[2]     |ADF2      |A/D ADINT2 Interrupt Flag
     * |        |          |0 = No ADINT2 interrupt pulse received.
     * |        |          |1 = ADINT2 interrupt pulse received.
     * |        |          |It is cleared by writing 1.
     * |        |          |This bit indicates whether an A/D conversion of specific SAMPLE has been completed.
     * |[3]     |ADF3      |A/D ADINT3 Interrupt Flag
     * |        |          |0 = No ADINT3 interrupt pulse received.
     * |        |          |1 = ADINT3 interrupt pulse received.
     * |        |          |It is cleared by writing 1.
     * |        |          |This bit indicates whether an A/D conversion of specific SAMPLE has been completed.
     * |[4]     |ADCMPO0   |EADC Compare 0 Output Status Bit
     * |        |          |The 12 bits compare0 data (ADCMPR0[27:16])  is used to compare with conversion
     * |        |          |result of specified SAMPLE. Software can use it to monitor the external analog input pin
     * |        |          |voltage status.
     * |        |          |0 = Conversion result in ADDR is less than ADCMPR0[27:16] setting.
     * |        |          |1 = Conversion result in ADDR is great than or equal ADCMPR0[27:16] setting.
     * |[5]     |ADCMPO1   |EADC Compare 1 Output Status Bit
     * |        |          |The 12 bits compare1 data (ADCMPR1[27:16])  is used to compare with conversion
     * |        |          |result of specified SAMPLE. Software can use it to monitor the external analog input pin
     * |        |          |voltage status.
     * |        |          |0 = Conversion result in ADDR is less than ADCMPR1[27:16] setting.
     * |        |          |1 = Conversion result in ADDR is great than or equal ADCMPR1[27:16] setting.
     * |[6]     |ADCMPF0   |EADC Compare 0 Flag
     * |        |          |When the specific SAMPLE A/D conversion result meets setting condition in ADCMPR0
     * |        |          |then this bit is set to 1. And it is cleared by write 1.
     * |        |          |0 = Conversion result in ADDR does not meet ADCMPR0 setting.
     * |        |          |1 = Conversion result in ADDR meets ADCMPR0 setting.
     * |[7]     |ADCMPF1   |EADC Compare 1 Flag
     * |        |          |When the specific SAMPLE A/D conversion result meets setting condition in ADCMPR1
     * |        |          |then this bit is set to 1. And it is cleared by write 1.
     * |        |          |0 = Conversion result in ADDR does not meet ADCMPR1 setting.
     * |        |          |1 = Conversion result in ADDR meets ADCMPR1 setting.
     * |[8]     |BUSYA     |BUSY/IDLE
     * |        |          |0 = A/D converter A (EADCA) is in idle state.
     * |        |          |1 = A/D converter A (EADCA) is busy at conversion.
     * |        |          |It is read only.
     * |[14:12] |CHANNELA  |Current Conversion Channel
     * |        |          |This filed reflects EADCA current conversion channel when BUSYA=1. When BUSYA=0, it
     * |        |          |shows the last converted channel.
     * |        |          |It is read only.
     * |        |          |00H = EADC0_CH0.
     * |        |          |01H = EADC0_CH1.
     * |        |          |02H = EADC0_CH2.
     * |        |          |03H = EADC0_CH3.
     * |        |          |04H = EADC0_CH4.
     * |        |          |05H = EADC0_CH5.
     * |        |          |06H = EADC0_CH6.
     * |        |          |07H = EADC0_CH7.
     * |[16]    |BUSYB     |BUSY/IDLE
     * |        |          |0 = A/D converter B (EADCB) is in idle state.
     * |        |          |1 = A/D converter B (EADCB) is busy at conversion.
     * |        |          |It is read only.
     * |[22:20] |CHANNELB  |Current Conversion Channel
     * |        |          |This filed reflects EADCB current conversion channel when BUSYB=1. When BUSYB=0, it
     * |        |          |shows the last converted channel.
     * |        |          |It is read only.
     * |        |          |00H = EADC1_CH0.
     * |        |          |01H = EADC1_CH1.
     * |        |          |02H = EADC1_CH2.
     * |        |          |03H = EADC1_CH3.
     * |        |          |04H = EADC1_CH4.
     * |        |          |05H = EADC1_CH5.
     * |        |          |06H = EADC1_CH6.
     * |        |          |07H = EADC1_CH7.
     * |[24]    |AADFOV    |All A/D Interrupt Flag Over Run Bits Check
     * |        |          |0 = None of ADINT interrupt flag ADFOVx is overwritten to 1.
     * |        |          |1 = Any one of ADINT interrupt flag ADFOVx is overwritten to 1.
     * |        |          |This bit will keep 1 when any ADFOVx Flag is equal to 1.
     * |[25]    |ASPOVF    |All A/D SAMPLE Start Conversion Over Run Flags Check
     * |        |          |0 = None of SAMPLE event over run flag SPOVFx is set to 1.
     * |        |          |1 = Any one of SAMPLE event over run flag SPOVFx is set to 1.
     * |        |          |This bit will keep 1 when any SPOVFx Flag is equal to 1.
     * |[26]    |AVALID    |All SAMPLE A/D Result Data Register ADDR Data Valid Flag Check
     * |        |          |0 = None of SAMPLE data register valid flag VALIDx is set to 1.
     * |        |          |1 = Any one of SAMPLE data register valid flag VALIDx is set to 1.
     * |        |          |This bit will keep 1 when any VALIDx Flag is equal to 1.
     * |[27]    |AOVERRUN  |All SAMPLE A/D Result Data Register Over Run Flags Check
     * |        |          |0 = None of SAMPLE data register over run flag OVERRUNx is set to 1.
     * |        |          |1 = Any one of SAMPLE data register over run flag OVERRUNx is set to 1.
     * |        |          |This bit will keep 1 when any OVERRUNx Flag is equal to 1.
     * @var EADC_T::ADTCR
     * Offset: 0xB8  A/D Timing Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |ADAEST    |EADCA Extend Sampling Time
     * |        |          |When A/D converting at high conversion rate, the sampling time of analog input voltage
     * |        |          |may not enough if input channel loading is heavy, SW can extend  A/D sampling time
     * |        |          |after trigger source is coming to get enough sampling time.
     * |        |          |The range of start delay time is from 0~255 EADC clock.
     * |[23:16] |ADBEST    |EADCB Extend Sampling Time
     * |        |          |When A/D converting at high conversion rate, the sampling time of analog input voltage
     * |        |          |may not enough if input channel loading is heavy, SW can extend  A/D sampling time
     * |        |          |after trigger source is coming to get enough sampling time.
     * |        |          |The range of start delay time is from 0~255 EADC clock.
     * @var EADC_T::ADDRDBA[4]
     * Offset: 0x100~0x10C  A/D Data Register Double Buffer for SAMPLE An, n=0~3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |RSLTDB    |A/D Conversion Result
     * |        |          |This field contains 12-bit conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Data in RSLT[11:0] bits is not valid.
     * |        |          |1 = Data in RSLT[11:0] bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is
     * |        |          |completed and cleared by hardware after ADDR register is read.
     * @var EADC_T::ADDRDBB[4]
     * Offset: 0x120~0x12C  A/D Data Register Double Buffer for SAMPLE Bn, n=0~3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |RSLTDB    |A/D Conversion Result
     * |        |          |This field contains 12-bit conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Data in RSLT[11:0] bits is not valid.
     * |        |          |1 = Data in RSLT[11:0] bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is
     * |        |          |completed and cleared by hardware after ADDR register is read.
     * @var EADC_T::ADDBM
     * Offset: 0x130  A/D Double Buffer Mode select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DBMA0     |Double Buffer Mode For SAMPLE A0
     * |        |          |0 = SampleA0 has one sample result register. (default).
     * |        |          |1 = SampleA0 has two sample result registers.
     * |[1]     |DBMA1     |Double Buffer Mode For SAMPLE A1
     * |        |          |0 = SampleA1 has one sample result register. (default).
     * |        |          |1 = SampleA1 has two sample result registers.
     * |[2]     |DBMA2     |Double Buffer Mode For SAMPLE A2
     * |        |          |0 = SampleA2 has one sample result register. (default).
     * |        |          |1 = SampleA2 has two sample result registers.
     * |[3]     |DBMA3     |Double Buffer Mode For SAMPLE A3
     * |        |          |0 = SampleA3 has one sample result register. (default).
     * |        |          |1 = SampleA3 has two sample result registers.
     * |[8]     |DBMB0     |Double Buffer Mode For SAMPLE B0
     * |        |          |0 = SampleB0 has one sample result register. (default).
     * |        |          |1 = SampleB0 has two sample result registers.
     * |[9]     |DBMB1     |Double Buffer Mode For SAMPLE B1
     * |        |          |0 = SampleB1 has one sample result register. (default).
     * |        |          |1 = SampleB1 has two sample result registers.
     * |[10]    |DBMB2     |Double Buffer Mode For SAMPLE B2
     * |        |          |0 = SampleB2 has one sample result register. (default).
     * |        |          |1 = SampleB2 has two sample result registers.
     * |[11]    |DBMB3     |Double Buffer Mode For SAMPLE B3
     * |        |          |0 = SampleB3 has one sample result register. (default).
     * |        |          |1 = SampleB3 has two sample result registers.
     * @var EADC_T::ADINTSRCTL[4]
     * Offset: 0x134~0x140  A/D interrupt n Source Enable Control Register, n=0~3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IESPLA0   |SAMPLE A0 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A0 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A0 interrupt mask Enabled.
     * |[1]     |IESPLA1   |SAMPLE A1 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A1 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A1 interrupt mask Enabled.
     * |[2]     |IESPLA2   |SAMPLE A2 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A2 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A2 interrupt mask Enabled.
     * |[3]     |IESPLA3   |SAMPLE A3 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A3 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A3 interrupt mask Enabled.
     * |[4]     |IESPLA4   |SAMPLE A4 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A4 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A4 interrupt mask Enabled.
     * |[5]     |IESPLA5   |SAMPLE A5 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A5 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A5 interrupt mask Enabled.
     * |[6]     |IESPLA6   |SAMPLE A6 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A6 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A6 interrupt mask Enabled.
     * |[7]     |IESPLA7   |SAMPLE A7 Interrupt Mask Enable
     * |        |          |0 = SAMPLE A7 interrupt mask Disabled.
     * |        |          |1 = SAMPLE A7 interrupt mask Enabled.
     * |[8]     |IESPLB0   |SAMPLE B0 Interrupt Mask Enable
