OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
     * |        |          |0 = SAMPLE B0 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B0 interrupt mask Enabled.
     * |[9]     |IESPLB1   |SAMPLE B1 Interrupt Mask Enable
     * |        |          |0 = SAMPLE B1 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B1 interrupt mask Enabled.
     * |[10]    |IESPLB2   |SAMPLE B2 Interrupt Mask Enable
     * |        |          |0 = SAMPLE B2 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B2 interrupt mask Enabled.
     * |[11]    |IESPLB3   |SAMPLE B3 Interrupt Mask Enable
     * |        |          |0 = SAMPLE B3 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B3 interrupt mask Enabled.
     * |[12]    |IESPLB4   |SAMPLE B4 Interrupt Mask Enable
     * |        |          |0 = SAMPLE B4 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B4 interrupt mask Enabled.
     * |[13]    |IESPLB5   |SAMPLE B5 Interrupt Mask Enable
     * |        |          |0 = SAMPLE B5 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B5 interrupt mask Enabled.
     * |[14]    |IESPLB6   |SAMPLE B6 Interrupt Mask Enable
     * |        |          |0 = SAMPLE B6 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B6 interrupt mask Enabled.
     * |[15]    |IESPLB7   |SAMPLE B7 Interrupt Mask Enable
     * |        |          |0 = SAMPLE B7 interrupt mask Disabled.
     * |        |          |1 = SAMPLE B7 interrupt mask Enabled.
     * @var EADC_T::SMPTRGA[4]
     * Offset: 0x144~0x150  A/D trigger condition for SAMPLEAn, n=0~3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWM00REN  |PWM00 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |PWM00FEN  |PWM00 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |PWM00PEN  |PWM00 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |PWM00CEN  |PWM00 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |PWM02REN  |PWM02 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |PWM02FEN  |PWM02 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |PWM02PEN  |PWM02 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[7]     |PWM02CEN  |PWM00 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[8]     |PWM04REN  |PWM04 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |PWM04FEN  |PWM04 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[10]    |PWM04PEN  |PWM04 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[11]    |PWM04CEN  |PWM04 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[12]    |PWM10REN  |PWM10 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[13]    |PWM10FEN  |PWM10 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |PWM10PEN  |PWM10 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[15]    |PWM10CEN  |PWM10 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |PWM12REN  |PWM12 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[17]    |PWM12FEN  |PWM12 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[18]    |PWM12PEN  |PWM12 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[19]    |PWM12CEN  |PWM12 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[20]    |PWM14REN  |PWM14 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[21]    |PWM14FEN  |PWM14 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[22]    |PWM14PEN  |PWM14 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[23]    |PWM14CEN  |PWM14 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[24]    |PWM20REN  |PWM20 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[25]    |PWM20FEN  |PWM20 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[26]    |PWM20PEN  |PWM20 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[27]    |PWM20CEN  |PWM20 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[28]    |PWM21REN  |PWM21 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[29]    |PWM21FEN  |PWM21 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[30]    |PWM21PEN  |PWM21 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[31]    |PWM21CEN  |PWM21 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * @var EADC_T::SMPTRGB[4]
     * Offset: 0x154~0x160  A/D trigger condition for SAMPLEBn, n=0~3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWM00REN  |PWM00 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |PWM00FEN  |PWM00 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |PWM00PEN  |PWM00 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |PWM00CEN  |PWM00 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |PWM02REN  |PWM02 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |PWM02FEN  |PWM02 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |PWM02PEN  |PWM02 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[7]     |PWM02CEN  |PWM00 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[8]     |PWM04REN  |PWM04 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |PWM04FEN  |PWM04 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[10]    |PWM04PEN  |PWM04 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[11]    |PWM04CEN  |PWM04 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[12]    |PWM10REN  |PWM10 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[13]    |PWM10FEN  |PWM10 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |PWM10PEN  |PWM10 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[15]    |PWM10CEN  |PWM10 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |PWM12REN  |PWM12 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[17]    |PWM12FEN  |PWM12 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[18]    |PWM12PEN  |PWM12 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[19]    |PWM12CEN  |PWM12 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[20]    |PWM14REN  |PWM14 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[21]    |PWM14FEN  |PWM14 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[22]    |PWM14PEN  |PWM14 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[23]    |PWM14CEN  |PWM14 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[24]    |PWM20REN  |PWM20 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[25]    |PWM20FEN  |PWM20 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[26]    |PWM20PEN  |PWM20 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[27]    |PWM20CEN  |PWM20 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[28]    |PWM21REN  |PWM21 Rising Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[29]    |PWM21FEN  |PWM21 Falling Edge Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[30]    |PWM21PEN  |PWM21 Period Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[31]    |PWM21CEN  |PWM21 Center Trigger Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     */

    __I  uint32_t ADDRA[8];      /* Offset: 0x00~0x1C  A/D Data Register n for SAMPLEAn, n=0~7                       */
    __I  uint32_t ADDRB[8];      /* Offset: 0x20~0x3C  A/D Data Register m for SAMPLEAn, m=8~15, n=0~7               */
    __IO uint32_t ADCR;          /* Offset: 0x40  EADC Control Register                                              */
    __IO uint32_t ADCHISELR;     /* Offset: 0x44  A/D Channel Input Sources Select Register                          */
    __O  uint32_t ADSSTR;        /* Offset: 0x48  A/D SAMPLE Software Start Register                                 */
    __I  uint32_t ADSTPFR;       /* Offset: 0x4C  A/D SAMPLE Start of Conversion Pending Flag Register               */
    __IO uint32_t ADIFOVR;       /* Offset: 0x50  A/D ADINT3~0 Interrupt Flag Over Run Register                      */
    __IO uint32_t ADSPOVFR;      /* Offset: 0x54  A/D SAMPLE Start of Conversion Over Run Flag Register              */
    __IO uint32_t ADSPCRA[8];    /* Offset: 0x58~0x74 ADSPCRA0~7 A/D SAMPLEAn Control Register, n=0~7                */
    __IO uint32_t ADSPCRB[8];    /* Offset: 0x78~0x94 ADSPCRB0~7 A/D SAMPLEBn Control Register, n=0~7                */
    __I  uint32_t RESERVE0[3];                                                                                         
    __IO uint32_t ADSMSELR;      /* Offset: 0xA4  A/D SAMPLE Simultaneous Mode Select Register                       */
    __IO uint32_t ADCMPR[2];     /* Offset: 0xA8~0xAC  A/D Result Compare Register 0/1                               */
    __I  uint32_t ADSR0;         /* Offset: 0xB0  A/D Status Register 0                                              */
    __IO uint32_t ADSR1;         /* Offset: 0xB4  A/D Status Register 1                                              */
    __IO uint32_t ADTCR;         /* Offset: 0xB8  A/D Timing Control Register                                        */
    __I  uint32_t RESERVE1[17];                                                                                        
    __I  uint32_t ADDRDBA[4];    /* Offset: 0x100~0x10C  A/D Data Register Double Buffer for SAMPLE An, n=0~3        */
    __I  uint32_t RESERVE2[4];                                                                                         
    __I  uint32_t ADDRDBB[4];    /* Offset: 0x120~0x12C  A/D Data Register Double Buffer for SAMPLE Bn, n=0~3        */
    __IO uint32_t ADDBM;         /* Offset: 0x130  A/D Double Buffer Mode select Register                            */
    __IO uint32_t ADINTSRCTL[4]; /* Offset: 0x134~0x140  A/D interrupt n Source Enable Control Register, n=0~3       */
    __IO uint32_t SMPTRGA[4];    /* Offset: 0x144~0x150  A/D trigger condition for SAMPLEAn, n=0~3                   */
    __IO uint32_t SMPTRGB[4];    /* Offset: 0x154~0x160  A/D trigger condition for SAMPLEBn, n=0~3                   */

} EADC_T;



/**
    @addtogroup EADC_CONST EADC Bit Field Definition
    Constant Definitions for EADC Controller
@{ */

/* ADDR Bit Field Definitions */
#define EADC_ADDR_VALID_Pos           17                                      /*!< EADC_T::ADDR: VALID Position */
#define EADC_ADDR_VALID_Msk           (1ul << EADC_ADDR_VALID_Pos)            /*!< EADC_T::ADDR: VALID Mask */

