OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
#define EADC_ADDR_OVERRUN_Pos         16                                      /*!< EADC_T::ADDR: OVERRUN Position */
#define EADC_ADDR_OVERRUN_Msk         (1ul << EADC_ADDR_OVERRUN_Pos)          /*!< EADC_T::ADDR: OVERRUN Mask */

#define EADC_ADDR_RSLT_Pos            0                                       /*!< EADC_T::ADDR: RSLT Position */
#define EADC_ADDR_RSLT_Msk            (0xFFFul << EADC_ADDR_RSLT_Pos)         /*!< EADC_T::ADDR: RSLT Mask */

/* ADDRA Bit Field Definitions */
#define EADC_ADDRA_VALID_Pos          17                                      /*!< EADC_T::ADDRA: VALID Position */
#define EADC_ADDRA_VALID_Msk          (1ul << EADC_ADDRA_VALID_Pos)           /*!< EADC_T::ADDRA: VALID Mask */

#define EADC_ADDRA_OVERRUN_Pos        16                                      /*!< EADC_T::ADDRA: OVERRUN Position */
#define EADC_ADDRA_OVERRUN_Msk        (1ul << EADC_ADDRA_OVERRUN_Pos)         /*!< EADC_T::ADDRA: OVERRUN Mask */

#define EADC_ADDRA_RSLT_Pos           0                                       /*!< EADC_T::ADDRA: RSLT Position */
#define EADC_ADDRA_RSLT_Msk           (0xFFFul << EADC_ADDRA_RSLT_Pos)        /*!< EADC_T::ADDRA: RSLT Mask */

/* ADDRB Bit Field Definitions */
#define EADC_ADDRB_VALID_Pos          17                                      /*!< EADC_T::ADDRB: VALID Position */
#define EADC_ADDRB_VALID_Msk          (1ul << EADC_ADDRB_VALID_Pos)           /*!< EADC_T::ADDRB: VALID Mask */

#define EADC_ADDRB_OVERRUN_Pos        16                                      /*!< EADC_T::ADDRB: OVERRUN Position */
#define EADC_ADDRB_OVERRUN_Msk        (1ul << EADC_ADDRB_OVERRUN_Pos)         /*!< EADC_T::ADDRB: OVERRUN Mask */

#define EADC_ADDRB_RSLT_Pos           0                                       /*!< EADC_T::ADDRB: RSLT Position */
#define EADC_ADDRB_RSLT_Msk           (0xFFFul << EADC_ADDRB_RSLT_Pos)        /*!< EADC_T::ADDRB: RSLT Mask */

/* ADCR Bit Field Definitions */
#define EADC_ADCR_ADIE3_Pos           5                                       /*!< EADC_T::ADCR: ADIE3 Position */
#define EADC_ADCR_ADIE3_Msk           (1ul << EADC_ADCR_ADIE3_Pos)            /*!< EADC_T::ADCR: ADIE3 Mask */

#define EADC_ADCR_ADIE2_Pos           4                                       /*!< EADC_T::ADCR: ADIE2 Position */
#define EADC_ADCR_ADIE2_Msk           (1ul << EADC_ADCR_ADIE2_Pos)            /*!< EADC_T::ADCR: ADIE2 Mask */

#define EADC_ADCR_ADIE1_Pos           3                                       /*!< EADC_T::ADCR: ADIE1 Position */
#define EADC_ADCR_ADIE1_Msk           (1ul << EADC_ADCR_ADIE1_Pos)            /*!< EADC_T::ADCR: ADIE1 Mask */

#define EADC_ADCR_ADIE0_Pos           2                                       /*!< EADC_T::ADCR: ADIE0 Position */
#define EADC_ADCR_ADIE0_Msk           (1ul << EADC_ADCR_ADIE0_Pos)            /*!< EADC_T::ADCR: ADIE0 Mask */

#define EADC_ADCR_ADRESET_Pos         1                                       /*!< EADC_T::ADCR: ADRESET Position */
#define EADC_ADCR_ADRESET_Msk         (1ul << EADC_ADCR_ADRESET_Pos)          /*!< EADC_T::ADCR: ADRESET Mask */

#define EADC_ADCR_AD_EN_Pos           0                                       /*!< EADC_T::ADCR: AD_EN Position */
#define EADC_ADCR_AD_EN_Msk           (1ul << EADC_ADCR_AD_EN_Pos)            /*!< EADC_T::ADCR: AD_EN Mask */

/* ADCHISELR Bit Field Definitions */
#define EADC_ADCHISELR_PRESEL_Pos     2                                       /*!< EADC_T::ADCHISELR: PRESEL Position */
#define EADC_ADCHISELR_PRESEL_Msk     (3ul << EADC_ADCHISELR_PRESEL_Pos)      /*!< EADC_T::ADCHISELR: PRESEL Mask */

#define EADC_ADCHISELR_AINB0SEL_Pos   1                                       /*!< EADC_T::ADCHISELR: AINB0SEL Position */
#define EADC_ADCHISELR_AINB0SEL_Msk   (1ul << EADC_ADCHISELR_AINB0SEL_Pos)    /*!< EADC_T::ADCHISELR: AINB0SEL Mask */

#define EADC_ADCHISELR_AINA0SEL_Pos   0                                       /*!< EADC_T::ADCHISELR: AINA0SEL Position */
#define EADC_ADCHISELR_AINA0SEL_Msk   (1ul << EADC_ADCHISELR_AINA0SEL_Pos)    /*!< EADC_T::ADCHISELR: AINA0SEL Mask */

/* ADSSTR Bit Field Definitions */
#define EADC_ADSSTR_ADST_Pos          0                                       /*!< EADC_T::ADSSTR: ADST Position */
#define EADC_ADSSTR_ADST_Msk          (0xFFFFul << EADC_ADSSTR_ADST_Pos)      /*!< EADC_T::ADSSTR: ADST Mask */

/* ADSTPFR Bit Field Definitions */
#define EADC_ADSTPFR_STPF_Pos         16                                      /*!< EADC_T::ADSTPFR: STPF Position */
#define EADC_ADSTPFR_STPF_Msk         (0xFFFFul << EADC_ADSTPFR_STPF_Pos)     /*!< EADC_T::ADSTPFR: STPF Mask */

/* ADIFOVR Bit Field Definitions */
#define EADC_ADIFOVR_ADFOV0_Pos       0                                       /*!< EADC_T::ADIFOVR: ADFOV0 Position */
#define EADC_ADIFOVR_ADFOV0_Msk       (1ul << EADC_ADIFOVR_ADFOV0_Pos)        /*!< EADC_T::ADIFOVR: ADFOV0 Mask */

#define EADC_ADIFOVR_ADFOV1_Pos       1                                       /*!< EADC_T::ADIFOVR: ADFOV1 Position */
#define EADC_ADIFOVR_ADFOV1_Msk       (1ul << EADC_ADIFOVR_ADFOV1_Pos)        /*!< EADC_T::ADIFOVR: ADFOV1 Mask */

#define EADC_ADIFOVR_ADFOV2_Pos       2                                       /*!< EADC_T::ADIFOVR: ADFOV2 Position */
#define EADC_ADIFOVR_ADFOV2_Msk       (1ul << EADC_ADIFOVR_ADFOV2_Pos)        /*!< EADC_T::ADIFOVR: ADFOV2 Mask */

#define EADC_ADIFOVR_ADFOV3_Pos       3                                       /*!< EADC_T::ADIFOVR: ADFOV3 Position */
#define EADC_ADIFOVR_ADFOV3_Msk       (1ul << EADC_ADIFOVR_ADFOV3_Pos)        /*!< EADC_T::ADIFOVR: ADFOV3 Mask */

/* ADSPOVFR Bit Field Definitions */
#define EADC_ADSPOVFR_SPOVF_Pos       0                                       /*!< EADC_T::ADSPOVFR: SPOVF Position */
#define EADC_ADSPOVFR_SPOVF_Msk       (0xFFFFul << EADC_ADSPOVFR_SPOVF_Pos)   /*!< EADC_T::ADSPOVFR: SPOVF Mask */

/* ADSPCR Bit Field Definitions */
#define EADC_ADSPCR_EXTFEN_Pos        21                                      /*!< EADC_T::ADSPCR: EXTFEN Position */
#define EADC_ADSPCR_EXTFEN_Msk        (1ul << EADC_ADSPCR_EXTFEN_Pos)         /*!< EADC_T::ADSPCR: EXTFEN Mask */

#define EADC_ADSPCR_EXTREN_Pos        20                                      /*!< EADC_T::ADSPCR: EXTREN Position */
#define EADC_ADSPCR_EXTREN_Msk        (1ul << EADC_ADSPCR_EXTREN_Pos)         /*!< EADC_T::ADSPCR: EXTREN Mask */

#define EADC_ADSPCR_TRGDLYDIV_Pos     16                                      /*!< EADC_T::ADSPCR: TRGDLYDIV Position */
#define EADC_ADSPCR_TRGDLYDIV_Msk     (3ul << EADC_ADSPCR_TRGDLYDIV_Pos)      /*!< EADC_T::ADSPCR: TRGDLYDIV Mask */

#define EADC_ADSPCR_TRGDLYCNT_Pos     8                                       /*!< EADC_T::ADSPCR: TRGDLYCNT Position */
#define EADC_ADSPCR_TRGDLYCNT_Msk     (0xFFul << EADC_ADSPCR_TRGDLYCNT_Pos)   /*!< EADC_T::ADSPCR: TRGDLYCNT Mask */

#define EADC_ADSPCR_TRGSEL_Pos        4                                       /*!< EADC_T::ADSPCR: TRGSEL Position */
#define EADC_ADSPCR_TRGSEL_Msk        (0xFul << EADC_ADSPCR_TRGSEL_Pos)       /*!< EADC_T::ADSPCR: TRGSEL Mask */

