OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
#define EADC_SMPTRG_PWM14PEN_Pos      22                                    /*!< EADC_T::SMPTRG: PWM14PEN Position */
#define EADC_SMPTRG_PWM14PEN_Msk      (1ul << EADC_SMPTRG_PWM14PEN_Pos)     /*!< EADC_T::SMPTRG: PWM14PEN Mask */

#define EADC_SMPTRG_PWM14FEN_Pos      21                                    /*!< EADC_T::SMPTRG: PWM14FEN Position */
#define EADC_SMPTRG_PWM14FEN_Msk      (1ul << EADC_SMPTRG_PWM14FEN_Pos)     /*!< EADC_T::SMPTRG: PWM14FEN Mask */

#define EADC_SMPTRG_PWM14REN_Pos      20                                    /*!< EADC_T::SMPTRG: PWM14REN Position */
#define EADC_SMPTRG_PWM14REN_Msk      (1ul << EADC_SMPTRG_PWM14REN_Pos)     /*!< EADC_T::SMPTRG: PWM14REN Mask */

#define EADC_SMPTRG_PWM12CEN_Pos      19                                    /*!< EADC_T::SMPTRG: PWM12CEN Position */
#define EADC_SMPTRG_PWM12CEN_Msk      (1ul << EADC_SMPTRG_PWM12CEN_Pos)     /*!< EADC_T::SMPTRG: PWM12CEN Mask */

#define EADC_SMPTRG_PWM12PEN_Pos      18                                    /*!< EADC_T::SMPTRG: PWM12PEN Position */
#define EADC_SMPTRG_PWM12PEN_Msk      (1ul << EADC_SMPTRG_PWM12PEN_Pos)     /*!< EADC_T::SMPTRG: PWM12PEN Mask */

#define EADC_SMPTRG_PWM12FEN_Pos      17                                    /*!< EADC_T::SMPTRG: PWM12FEN Position */
#define EADC_SMPTRG_PWM12FEN_Msk      (1ul << EADC_SMPTRG_PWM12FEN_Pos)     /*!< EADC_T::SMPTRG: PWM12FEN Mask */

#define EADC_SMPTRG_PWM12REN_Pos      16                                    /*!< EADC_T::SMPTRG: PWM12REN Position */
#define EADC_SMPTRG_PWM12REN_Msk      (1ul << EADC_SMPTRG_PWM12REN_Pos)     /*!< EADC_T::SMPTRG: PWM12REN Mask */

#define EADC_SMPTRG_PWM10CEN_Pos      15                                    /*!< EADC_T::SMPTRG: PWM10CEN Position */
#define EADC_SMPTRG_PWM10CEN_Msk      (1ul << EADC_SMPTRG_PWM10CEN_Pos)     /*!< EADC_T::SMPTRG: PWM10CEN Mask */

#define EADC_SMPTRG_PWM10PEN_Pos      14                                    /*!< EADC_T::SMPTRG: PWM10PEN Position */
#define EADC_SMPTRG_PWM10PEN_Msk      (1ul << EADC_SMPTRG_PWM10PEN_Pos)     /*!< EADC_T::SMPTRG: PWM10PEN Mask */

#define EADC_SMPTRG_PWM10FEN_Pos      13                                    /*!< EADC_T::SMPTRG: PWM10FEN Position */
#define EADC_SMPTRG_PWM10FEN_Msk      (1ul << EADC_SMPTRG_PWM10FEN_Pos)     /*!< EADC_T::SMPTRG: PWM10FEN Mask */

#define EADC_SMPTRG_PWM10REN_Pos      12                                    /*!< EADC_T::SMPTRG: PWM10REN Position */
#define EADC_SMPTRG_PWM10REN_Msk      (1ul << EADC_SMPTRG_PWM10REN_Pos)     /*!< EADC_T::SMPTRG: PWM10REN Mask */

#define EADC_SMPTRG_PWM04CEN_Pos      11                                    /*!< EADC_T::SMPTRG: PWM04CEN Position */
#define EADC_SMPTRG_PWM04CEN_Msk      (1ul << EADC_SMPTRG_PWM04CEN_Pos)     /*!< EADC_T::SMPTRG: PWM04CEN Mask */

#define EADC_SMPTRG_PWM04PEN_Pos      10                                    /*!< EADC_T::SMPTRG: PWM04PEN Position */
#define EADC_SMPTRG_PWM04PEN_Msk      (1ul << EADC_SMPTRG_PWM04PEN_Pos)     /*!< EADC_T::SMPTRG: PWM04PEN Mask */

#define EADC_SMPTRG_PWM04FEN_Pos      9                                     /*!< EADC_T::SMPTRG: PWM04FEN Position */
#define EADC_SMPTRG_PWM04FEN_Msk      (1ul << EADC_SMPTRG_PWM04FEN_Pos)     /*!< EADC_T::SMPTRG: PWM04FEN Mask */

#define EADC_SMPTRG_PWM04REN_Pos      8                                     /*!< EADC_T::SMPTRG: PWM04REN Position */
#define EADC_SMPTRG_PWM04REN_Msk      (1ul << EADC_SMPTRG_PWM04REN_Pos)     /*!< EADC_T::SMPTRG: PWM04REN Mask */

#define EADC_SMPTRG_PWM02CEN_Pos      7                                     /*!< EADC_T::SMPTRG: PWM02CEN Position */
#define EADC_SMPTRG_PWM02CEN_Msk      (1ul << EADC_SMPTRG_PWM02CEN_Pos)     /*!< EADC_T::SMPTRG: PWM02CEN Mask */

#define EADC_SMPTRG_PWM02PEN_Pos      6                                     /*!< EADC_T::SMPTRG: PWM02PEN Position */
#define EADC_SMPTRG_PWM02PEN_Msk      (1ul << EADC_SMPTRG_PWM02PEN_Pos)     /*!< EADC_T::SMPTRG: PWM02PEN Mask */

#define EADC_SMPTRG_PWM02FEN_Pos      5                                     /*!< EADC_T::SMPTRG: PWM02FEN Position */
#define EADC_SMPTRG_PWM02FEN_Msk      (1ul << EADC_SMPTRG_PWM02FEN_Pos)     /*!< EADC_T::SMPTRG: PWM02FEN Mask */

#define EADC_SMPTRG_PWM02REN_Pos      4                                     /*!< EADC_T::SMPTRG: PWM02REN Position */
#define EADC_SMPTRG_PWM02REN_Msk      (1ul << EADC_SMPTRG_PWM02REN_Pos)     /*!< EADC_T::SMPTRG: PWM02REN Mask */

#define EADC_SMPTRG_PWM00CEN_Pos      3                                     /*!< EADC_T::SMPTRG: PWM00CEN Position */
#define EADC_SMPTRG_PWM00CEN_Msk      (1ul << EADC_SMPTRG_PWM00CEN_Pos)     /*!< EADC_T::SMPTRG: PWM00CEN Mask */

#define EADC_SMPTRG_PWM00PEN_Pos      2                                     /*!< EADC_T::SMPTRG: PWM00PEN Position */
#define EADC_SMPTRG_PWM00PEN_Msk      (1ul << EADC_SMPTRG_PWM00PEN_Pos)     /*!< EADC_T::SMPTRG: PWM00PEN Mask */

#define EADC_SMPTRG_PWM00FEN_Pos      1                                     /*!< EADC_T::SMPTRG: PWM00FEN Position */
#define EADC_SMPTRG_PWM00FEN_Msk      (1ul << EADC_SMPTRG_PWM00FEN_Pos)     /*!< EADC_T::SMPTRG: PWM00FEN Mask */

#define EADC_SMPTRG_PWM00REN_Pos      0                                     /*!< EADC_T::SMPTRG: PWM00REN Position */
#define EADC_SMPTRG_PWM00REN_Msk      (1ul << EADC_SMPTRG_PWM00REN_Pos)     /*!< EADC_T::SMPTRG: PWM00REN Mask */

/* SMPTRGA Bit Field Definitions */
#define EADC_SMPTRGA_PWM21CEN_Pos     31                                    /*!< EADC_T::SMPTRGA: PWM21CEN Position */
#define EADC_SMPTRGA_PWM21CEN_Msk     (1ul << EADC_SMPTRGA_PWM21CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM21CEN Mask */

#define EADC_SMPTRGA_PWM21PEN_Pos     30                                    /*!< EADC_T::SMPTRGA: PWM21PEN Position */
#define EADC_SMPTRGA_PWM21PEN_Msk     (1ul << EADC_SMPTRGA_PWM21PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM21PEN Mask */

#define EADC_SMPTRGA_PWM21FEN_Pos     29                                    /*!< EADC_T::SMPTRGA: PWM21FEN Position */
#define EADC_SMPTRGA_PWM21FEN_Msk     (1ul << EADC_SMPTRGA_PWM21FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM21FEN Mask */

