OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
#define EADC_SMPTRGA_PWM21REN_Pos     28                                    /*!< EADC_T::SMPTRGA: PWM21REN Position */
#define EADC_SMPTRGA_PWM21REN_Msk     (1ul << EADC_SMPTRGA_PWM21REN_Pos)    /*!< EADC_T::SMPTRGA: PWM21REN Mask */

#define EADC_SMPTRGA_PWM20CEN_Pos     27                                    /*!< EADC_T::SMPTRGA: PWM20CEN Position */
#define EADC_SMPTRGA_PWM20CEN_Msk     (1ul << EADC_SMPTRGA_PWM20CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM20CEN Mask */

#define EADC_SMPTRGA_PWM20PEN_Pos     26                                    /*!< EADC_T::SMPTRGA: PWM20PEN Position */
#define EADC_SMPTRGA_PWM20PEN_Msk     (1ul << EADC_SMPTRGA_PWM20PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM20PEN Mask */

#define EADC_SMPTRGA_PWM20FEN_Pos     25                                    /*!< EADC_T::SMPTRGA: PWM20FEN Position */
#define EADC_SMPTRGA_PWM20FEN_Msk     (1ul << EADC_SMPTRGA_PWM20FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM20FEN Mask */

#define EADC_SMPTRGA_PWM20REN_Pos     24                                    /*!< EADC_T::SMPTRGA: PWM20REN Position */
#define EADC_SMPTRGA_PWM20REN_Msk     (1ul << EADC_SMPTRGA_PWM20REN_Pos)    /*!< EADC_T::SMPTRGA: PWM20REN Mask */

#define EADC_SMPTRGA_PWM14CEN_Pos     23                                    /*!< EADC_T::SMPTRGA: PWM14CEN Position */
#define EADC_SMPTRGA_PWM14CEN_Msk     (1ul << EADC_SMPTRGA_PWM14CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM14CEN Mask */

#define EADC_SMPTRGA_PWM14PEN_Pos     22                                    /*!< EADC_T::SMPTRGA: PWM14PEN Position */
#define EADC_SMPTRGA_PWM14PEN_Msk     (1ul << EADC_SMPTRGA_PWM14PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM14PEN Mask */

#define EADC_SMPTRGA_PWM14FEN_Pos     21                                    /*!< EADC_T::SMPTRGA: PWM14FEN Position */
#define EADC_SMPTRGA_PWM14FEN_Msk     (1ul << EADC_SMPTRGA_PWM14FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM14FEN Mask */

#define EADC_SMPTRGA_PWM14REN_Pos     20                                    /*!< EADC_T::SMPTRGA: PWM14REN Position */
#define EADC_SMPTRGA_PWM14REN_Msk     (1ul << EADC_SMPTRGA_PWM14REN_Pos)    /*!< EADC_T::SMPTRGA: PWM14REN Mask */

#define EADC_SMPTRGA_PWM12CEN_Pos     19                                    /*!< EADC_T::SMPTRGA: PWM12CEN Position */
#define EADC_SMPTRGA_PWM12CEN_Msk     (1ul << EADC_SMPTRGA_PWM12CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM12CEN Mask */

#define EADC_SMPTRGA_PWM12PEN_Pos     18                                    /*!< EADC_T::SMPTRGA: PWM12PEN Position */
#define EADC_SMPTRGA_PWM12PEN_Msk     (1ul << EADC_SMPTRGA_PWM12PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM12PEN Mask */

#define EADC_SMPTRGA_PWM12FEN_Pos     17                                    /*!< EADC_T::SMPTRGA: PWM12FEN Position */
#define EADC_SMPTRGA_PWM12FEN_Msk     (1ul << EADC_SMPTRGA_PWM12FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM12FEN Mask */

#define EADC_SMPTRGA_PWM12REN_Pos     16                                    /*!< EADC_T::SMPTRGA: PWM12REN Position */
#define EADC_SMPTRGA_PWM12REN_Msk     (1ul << EADC_SMPTRGA_PWM12REN_Pos)    /*!< EADC_T::SMPTRGA: PWM12REN Mask */

#define EADC_SMPTRGA_PWM10CEN_Pos     15                                    /*!< EADC_T::SMPTRGA: PWM10CEN Position */
#define EADC_SMPTRGA_PWM10CEN_Msk     (1ul << EADC_SMPTRGA_PWM10CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM10CEN Mask */

#define EADC_SMPTRGA_PWM10PEN_Pos     14                                    /*!< EADC_T::SMPTRGA: PWM10PEN Position */
#define EADC_SMPTRGA_PWM10PEN_Msk     (1ul << EADC_SMPTRGA_PWM10PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM10PEN Mask */

#define EADC_SMPTRGA_PWM10FEN_Pos     13                                    /*!< EADC_T::SMPTRGA: PWM10FEN Position */
#define EADC_SMPTRGA_PWM10FEN_Msk     (1ul << EADC_SMPTRGA_PWM10FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM10FEN Mask */

#define EADC_SMPTRGA_PWM10REN_Pos     12                                    /*!< EADC_T::SMPTRGA: PWM10REN Position */
#define EADC_SMPTRGA_PWM10REN_Msk     (1ul << EADC_SMPTRGA_PWM10REN_Pos)    /*!< EADC_T::SMPTRGA: PWM10REN Mask */

#define EADC_SMPTRGA_PWM04CEN_Pos     11                                    /*!< EADC_T::SMPTRGA: PWM04CEN Position */
#define EADC_SMPTRGA_PWM04CEN_Msk     (1ul << EADC_SMPTRGA_PWM04CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM04CEN Mask */

#define EADC_SMPTRGA_PWM04PEN_Pos     10                                    /*!< EADC_T::SMPTRGA: PWM04PEN Position */
#define EADC_SMPTRGA_PWM04PEN_Msk     (1ul << EADC_SMPTRGA_PWM04PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM04PEN Mask */

#define EADC_SMPTRGA_PWM04FEN_Pos     9                                     /*!< EADC_T::SMPTRGA: PWM04FEN Position */
#define EADC_SMPTRGA_PWM04FEN_Msk     (1ul << EADC_SMPTRGA_PWM04FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM04FEN Mask */

#define EADC_SMPTRGA_PWM04REN_Pos     8                                     /*!< EADC_T::SMPTRGA: PWM04REN Position */
#define EADC_SMPTRGA_PWM04REN_Msk     (1ul << EADC_SMPTRGA_PWM04REN_Pos)    /*!< EADC_T::SMPTRGA: PWM04REN Mask */

#define EADC_SMPTRGA_PWM02CEN_Pos     7                                     /*!< EADC_T::SMPTRGA: PWM02CEN Position */
#define EADC_SMPTRGA_PWM02CEN_Msk     (1ul << EADC_SMPTRGA_PWM02CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM02CEN Mask */

#define EADC_SMPTRGA_PWM02PEN_Pos     6                                     /*!< EADC_T::SMPTRGA: PWM02PEN Position */
#define EADC_SMPTRGA_PWM02PEN_Msk     (1ul << EADC_SMPTRGA_PWM02PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM02PEN Mask */

#define EADC_SMPTRGA_PWM02FEN_Pos     5                                     /*!< EADC_T::SMPTRGA: PWM02FEN Position */
#define EADC_SMPTRGA_PWM02FEN_Msk     (1ul << EADC_SMPTRGA_PWM02FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM02FEN Mask */

#define EADC_SMPTRGA_PWM02REN_Pos     4                                     /*!< EADC_T::SMPTRGA: PWM02REN Position */
#define EADC_SMPTRGA_PWM02REN_Msk     (1ul << EADC_SMPTRGA_PWM02REN_Pos)    /*!< EADC_T::SMPTRGA: PWM02REN Mask */

#define EADC_SMPTRGA_PWM00CEN_Pos     3                                     /*!< EADC_T::SMPTRGA: PWM00CEN Position */
#define EADC_SMPTRGA_PWM00CEN_Msk     (1ul << EADC_SMPTRGA_PWM00CEN_Pos)    /*!< EADC_T::SMPTRGA: PWM00CEN Mask */

#define EADC_SMPTRGA_PWM00PEN_Pos     2                                     /*!< EADC_T::SMPTRGA: PWM00PEN Position */
#define EADC_SMPTRGA_PWM00PEN_Msk     (1ul << EADC_SMPTRGA_PWM00PEN_Pos)    /*!< EADC_T::SMPTRGA: PWM00PEN Mask */

