OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
/* EPWM PWMEIC Bit Field Definitions */
#define EPWM_PWMEIC_EINT4_TYPE_Pos               10                                     /*!< EPWM_T::PWMEIC: EINT4_TYPE Position */
#define EPWM_PWMEIC_EINT4_TYPE_Msk               (0x1ul << EPWM_PWMEIC_EINT4_TYPE_Pos)  /*!< EPWM_T::PWMEIC: EINT4_TYPE Mask */

#define EPWM_PWMEIC_EINT2_TYPE_Pos               9                                      /*!< EPWM_T::PWMEIC: EINT2_TYPE Position */
#define EPWM_PWMEIC_EINT2_TYPE_Msk               (0x1ul << EPWM_PWMEIC_EINT2_TYPE_Pos)  /*!< EPWM_T::PWMEIC: EINT2_TYPE Mask */

#define EPWM_PWMEIC_EINT0_TYPE_Pos               8                                      /*!< EPWM_T::PWMEIC: EINT0_TYPE Position */
#define EPWM_PWMEIC_EINT0_TYPE_Msk               (0x1ul << EPWM_PWMEIC_EINT0_TYPE_Pos)  /*!< EPWM_T::PWMEIC: EINT0_TYPE Mask */

#define EPWM_PWMEIC_PWM4EI_EN_Pos                2                                      /*!< EPWM_T::PWMEIC: PWM4EI_EN Position */
#define EPWM_PWMEIC_PWM4EI_EN_Msk                (0x1ul << EPWM_PWMEIC_PWM4EI_EN_Pos)   /*!< EPWM_T::PWMEIC: PWM4EI_EN Mask */

#define EPWM_PWMEIC_PWM2EI_EN_Pos                1                                      /*!< EPWM_T::PWMEIC: PWM2EI_EN Position */
#define EPWM_PWMEIC_PWM2EI_EN_Msk                (0x1ul << EPWM_PWMEIC_PWM2EI_EN_Pos)   /*!< EPWM_T::PWMEIC: PWM2EI_EN Mask */

#define EPWM_PWMEIC_PWM0EI_EN_Pos                0                                      /*!< EPWM_T::PWMEIC: PWM0EI_EN Position */
#define EPWM_PWMEIC_PWM0EI_EN_Msk                (0x1ul << EPWM_PWMEIC_PWM0EI_EN_Pos)   /*!< EPWM_T::PWMEIC: PWM0EI_EN Mask */

/*@}*/ /* end of group EPWM_CONST */
/*@}*/ /* end of group EPWM */



/*---------------------- Flash Memory Controller -------------------------*/
/**
    @addtogroup FMC Flash Memory Controller (FMC)
    Memory Mapped Structure for FMC Controller
@{ */

typedef struct
{


    /**
     * @var FMC_T::ISPCON
     * Offset: 0x00  ISP Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ISPEN     |ISP Enable(Write-Protected)
     * |        |          |This bit is protected bit. ISP function enable bit. Set this bit to enable ISP function.
     * |        |          |0 = Disable ISP function
     * |        |          |1 = Enable ISP function
     * |[1]     |BS        |Boot Select(Write-Protected)
     * |        |          |This bit is protected bit. Set/clear this bit to select next booting from LDROM/APROM,
     * |        |          |respectively. This bit also functions as MCU booting status flag, which can be used to check where
     * |        |          |MCU booted from. This bit is initiated with the inverted value of CBS in Config0 after power-
     * |        |          |on reset; It keeps the same value at other reset.
     * |        |          |0 = boot from APROM
     * |        |          |1 = boot from LDROM
     * |[3]     |APUEN     |APROM Update Enable(Write-Protected)
     * |        |          |0 = APROM cannot be updated when the chip runs in APROM
     * |        |          |1 = APROM can be updated when the chip runs in APROM
     * |[4]     |CFGUEN    |Config Update Enable(Write-Protected)
     * |        |          |Writing this bit to 1 enables S/W to update Config value by ISP procedure regardless of program
     * |        |          |code is running in APROM or LDROM.
     * |        |          |0 = Config update disable
     * |        |          |1 = Config update enable
     * |[5]     |LDUEN     |LDROM Update Enable(Write-Protected)
     * |        |          |LDROM update enable bit.
     * |        |          |0 = LDROM cannot be updated
     * |        |          |1 = LDROM can be updated when the MCU runs in APROM.
     * |[6]     |ISPFF     |ISP Fail Flag(Write-Protected)
     * |        |          |This bit is set by hardware when a triggered ISP meets any of the following conditions:
     * |        |          |(1) APROM writes to itself.
     * |        |          |(2) LDROM writes to itself.
     * |        |          |(3) CONFIG is erased/programmed when CFGUEN is set to 0
     * |        |          |(4) Destination address is illegal, such as over an available range.
     * |        |          |Write 1 to clear.
     * @var FMC_T::ISPADR
     * Offset: 0x04  ISP Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |ISPADR    |ISP Address
     * |        |          |The NuMicro M0519 Series has a maximum 32Kx32 (128 KB) of embedded Flash,
     * |        |          |which supports word program only. ISPADR[1:0] must be kept 00b for ISP operation.
     * @var FMC_T::ISPDAT
     * Offset: 0x08  ISP Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |ISPDAT    |ISP Data
     * |        |          |Write data to this register before ISP program operation
     * |        |          |Read data from this register after ISP read operation
     * @var FMC_T::ISPCMD
     * Offset: 0x0C  ISP Command Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |ISPCMD    |ISP Command
     * |        |          |ISP command table is shown below:
     * |        |          |0x00   =  Read.
     * |        |          |0x21   =  Program.
     * |        |          |0x22   =  Page Erase.
     * |        |          |0x2E   =  Vector page Re-Map.
     * @var FMC_T::ISPTRG
     * Offset: 0x10  ISP Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ISPGO     |ISP Start Trigger(Write-Protection)
     * |        |          |Write 1 to start ISP operation and this bit will be cleared to 0 by hardware automatically when ISP
     * |        |          |operation is finish.
     * |        |          |0 = ISP done
     * |        |          |1 = ISP is on going
     * @var FMC_T::DFBADR
     * Offset: 0x14  Data Flash Base Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |DFBADR    |Data Flash Base Address
     * |        |          |This register indicates data flash start address.
     * |        |          |It is read only.
     * |        |          |For 128 KB flash memory device, the data flash size is defined by user configuration,
     * |        |          |register content is loaded from Config1 when chip is powered on but for 64/32 KB device,
     * |        |          |it is fixed at 0x0001_F000.
     * @var FMC_T::FATCON
     * Offset: 0x18  Flash Access Time Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4]     |FOM_SEL[0]|Chip Frequency Optimization Mode Select(Write-Protection)
     * |        |          |When chip operation frequency is lower than 25 MHz, chip can work more efficiently by setting FOM_SEL[1:0] = 01.
     * |        |          |When chip operation frequency is lower than 50 MHz, chip can work more efficiently by setting FOM_SEL[1:0] = 00.
     * |        |          |When chip operation frequency is over than 50 MHz, chip only can work by setting FOM_SEL[1:0] = 11.
     * |        |          |00 = Middle frequency optimization mode Enabled.
     * |        |          |01 = Low frequency optimization mode Enabled.
     * |        |          |10 = Reserved.
     * |        |          |11 = High frequency optimization mode Enabled.
     * |[6]     |FOM_SEL[1]|Chip Frequency Optimization Mode Select(Write-Protection)
     * |        |          |When chip operation frequency is lower than 25 MHz, chip can work more efficiently by setting FOM_SEL[1:0] = 01.
     * |        |          |When chip operation frequency is lower than 50 MHz, chip can work more efficiently by setting FOM_SEL[1:0] = 00.
     * |        |          |When chip operation frequency is over than 50 MHz, chip only can work by setting FOM_SEL[1:0] = 11.
     * |        |          |00 = Middle frequency optimization mode Enabled.
     * |        |          |01 = Low frequency optimization mode Enabled.
     * |        |          |10 = Reserved.
     * |        |          |11 = High frequency optimization mode Enabled.
     * @var FMC_T::ISPSTA
     * Offset: 0x40  ISP Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ISPGO     |ISP Start Trigger (Read Only)
     * |        |          |Write 1 to start ISP operation and this bit will be cleared to 0 by hardware
     * |        |          |automatically when ISP operation is finished.
     * |        |          |0 = ISP operation finished.
     * |        |          |1 = ISP operation progressed.
     * |        |          |Note: This bit is the same as ISPTRG bit0
     * |[2:1]   |CBS       |Chip Boot Selection (Read Only)
     * |        |          |This is a mirror of CBS in Config0.
     * |[6]     |ISPFF     |ISP Fail Flag (Write-protection Bit)
     * |        |          |This bit is set by hardware when a triggered ISP meets any of the following conditions:
     * |        |          |(1) APROM writes to itself.
     * |        |          |(2) LDROM writes to itself.
     * |        |          |(3) CONFIG is erased/programmed when CFGUEN is set to 0
     * |        |          |(4) Destination address is illegal, such as over an available range.
     * |[20:9]  |VECMAP    |Vector Page Mapping Address (Read Only)
     * |        |          |The current flash address space 0x0000_0000~0x0000_01FF is mapping to the address
     * |        |          |{VECMAP[11:0], 9'h000} ~ {VECMAP[11:0], 9'h1FF}
     */

    __IO uint32_t ISPCON;        /* Offset: 0x00  ISP Control Register                                               */
    __IO uint32_t ISPADR;        /* Offset: 0x04  ISP Address Register                                               */
    __IO uint32_t ISPDAT;        /* Offset: 0x08  ISP Data Register                                                  */
    __IO uint32_t ISPCMD;        /* Offset: 0x0C  ISP Command Register                                               */
    __IO uint32_t ISPTRG;        /* Offset: 0x10  ISP Trigger Control Register                                       */
    __I  uint32_t DFBADR;        /* Offset: 0x14  Data Flash Base Address Register                                   */
    __IO uint32_t FATCON;        /* Offset: 0x18  Flash Access Time Control Register                                 */
    __I  uint32_t RESERVED[9];
    __IO uint32_t ISPSTA;        /* Offset: 0x40  ISP Status Register                                                */

} FMC_T;



/**
    @addtogroup FMC_CONST FMC Bit Field Definition
    Constant Definitions for FMC Controller
@{ */

/* FMC ISPCON Bit Field Definitions */
#define FMC_ISPCON_ISPFF_Pos                    6                                       /*!< FMC_T::ISPCON: ISPFF Position */
#define FMC_ISPCON_ISPFF_Msk                    (1ul << FMC_ISPCON_ISPFF_Pos)           /*!< FMC_T::ISPCON: ISPFF Mask */

#define FMC_ISPCON_LDUEN_Pos                    5                                       /*!< FMC_T::ISPCON: LDUEN Position */
#define FMC_ISPCON_LDUEN_Msk                    (1ul << FMC_ISPCON_LDUEN_Pos)           /*!< FMC_T::ISPCON: LDUEN Mask */

#define FMC_ISPCON_CFGUEN_Pos                   4                                       /*!< FMC_T::ISPCON: CFGUEN Position */
#define FMC_ISPCON_CFGUEN_Msk                   (1ul << FMC_ISPCON_CFGUEN_Pos)          /*!< FMC_T::ISPCON: CFGUEN Mask */

#define FMC_ISPCON_APUEN_Pos                    3                                       /*!< FMC_T::ISPCON: APUEN Position */
#define FMC_ISPCON_APUEN_Msk                    (1ul << FMC_ISPCON_APUEN_Pos)           /*!< FMC_T::ISPCON: APUEN Mask */

#define FMC_ISPCON_BS_Pos                       1                                       /*!< FMC_T::ISPCON: BS Position */
#define FMC_ISPCON_BS_Msk                       (0x1ul << FMC_ISPCON_BS_Pos)            /*!< FMC_T::ISPCON: BS Mask */

