OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
    __IO uint32_t PMD;           /* Offset: 0x00  GPIO Port I/O Mode Control                                         */
    __IO uint32_t OFFD;          /* Offset: 0x04  GPIO Port Digital Input Path Disable Control                       */
    __IO uint32_t DOUT;          /* Offset: 0x08  GPIO Port Data Output Value                                        */
    __IO uint32_t DMASK;         /* Offset: 0x0C  GPIO Port Data Output Write Mask                                   */
    __I  uint32_t PIN;           /* Offset: 0x10  GPIO Port Pin Value                                                 */
    __IO uint32_t DBEN;          /* Offset: 0x14  GPIO Port De-bounce Enable                                         */
    __IO uint32_t IMD;           /* Offset: 0x18  GPIO Port Interrupt Mode Control                                    */
    __IO uint32_t IEN;           /* Offset: 0x1C  GPIO Port Interrupt Enable Control                                 */
    __IO uint32_t ISF;           /* Offset: 0x20  GPIO Port Interrupt Source Flag                                    */

} GPIO_T;




typedef struct
{


    /**
     * @var GPIO_DBNCECON_T::DBNCECON
     * Offset: 0x2E0  External Interrupt De-bounce Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |DBCLKSEL  |De-Bounce Sampling Cycle Selection
     * |        |          |0000 = Sample interrupt input once per 1 clocks
     * |        |          |0001 = Sample interrupt input once per 2 clocks
     * |        |          |0010 = Sample interrupt input once per 4 clocks
     * |        |          |0011 = Sample interrupt input once per 8 clocks
     * |        |          |0100 = Sample interrupt input once per 16 clocks
     * |        |          |0101 = Sample interrupt input once per 32 clocks
     * |        |          |0110 = Sample interrupt input once per 64 clocks
     * |        |          |0111 = Sample interrupt input once per 128 clocks
     * |        |          |1000 = Sample interrupt input once per 256 clocks
     * |        |          |1001 = Sample interrupt input once per 2*256 clocks
     * |        |          |1010 = Sample interrupt input once per 4*256clocks
     * |        |          |1011 = Sample interrupt input once per 8*256 clocks
     * |        |          |1100 = Sample interrupt input once per 16*256 clocks
     * |        |          |1101 = Sample interrupt input once per 32*256 clocks
     * |        |          |1110 = Sample interrupt input once per 64*256 clocks
     * |        |          |1111 = Sample interrupt input once per 128*256 clocks
     * |[4]     |DBCLKSRC  |De-Bounce Counter Clock Source Selection
     * |        |          |0 = De-bounce counter clock source is the HCLK.
     * |        |          |1 = De-bounce counter clock source is the internal 10 kHz low speed oscillator.
     * |[5]     |ICLK_ON   |Interrupt Clock On Mode
     * |        |          |0 = Edge detection circuit is active only if I/O pin corresponding Px_IEN bit is set to 1.
     * |        |          |1 = All I/O pins edge detection circuit is always active after reset.
     * |        |          |It is recommended to turn off this bit to save system power if no special application concern.
     * @var GPIO_DBNCECON_T::PWMPOEN
     * Offset: 0x2E4  PWM Port Output Enable
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HZ_Even0  |Enhanced PWM Unit0 Even Ports Output Control
     * |        |          |0 = The driving mode of EPWM unit0 even ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP).
     * |        |          |1 = The driving mode of EPWM unit0 even ports are forced in tri-state (Hi-Z) all the time.
     * |        |          |The initial value is loaded from CHZ_Even0 (Config0[8]) after any reset.
     * |[1]     |HZ_Odd0   |Enhanced PWM Unit0 Odd Ports Output Control
     * |        |          |0 = The driving mode of EPWM unit0 odd ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP).
     * |        |          |1 = The driving mode of EPWM unit0 odd ports are forced in tri-state (Hi-Z) all the time.
     * |        |          |The initial value is loaded from CHZ_Odd0 (Config0[9]) after any reset.
     * |[2]     |HZ_Even1  |Enhanced PWM Unit1 Even Ports Output Control
     * |        |          |0 = The driving mode of EPWM unit1 even ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP).
     * |        |          |1 = The driving mode of EPWM unit1 even ports are forced in tri-state (Hi-Z) all the time.
     * |        |          |The initial value is loaded from CHZ_Even1 (Config0[10]) after any reset.
     * |[3]     |HZ_Odd1   |Enhanced PWM Unit1 Odd Ports Output Control
     * |        |          |0 = The driving mode of EPWM unit1 odd ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP).
     * |        |          |1 = The driving mode of EPWM unit1 odd ports are forced in tri-state (Hi-Z) all the time.
     * |        |          |The initial value is loaded from CHZ_Odd1 (Config0[11]) after any reset.
     * |[4]     |HZ_BPWM   |Basic PWM Ports Output Control
     * |        |          |0 = The driving mode of Basic PWM ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP).
     * |        |          |1 = The driving mode of Basic PWM ports are forced in tri-state (Hi-Z) all the time.
     * |        |          |The initial value is loaded from CHZ_BPWM (Config0[12]) after any reset.
     */

    __IO uint32_t DBNCECON;      /* Offset: 0x2E0  External Interrupt De-bounce Control                              */
    __IO uint32_t PWMPOEN;       /* Offset: 0x2E4  PWM Port Output Enable                                            */

} GPIO_DBNCECON_T;



/**
    @addtogroup GPIO_CONST GPIO Bit Field Definition
    Constant Definitions for GPIO Controller
@{ */


