OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
     * |[6]     |P1_MFP[6] |P1.6 Multi-Function Selection
     * |        |          |This bit selects P1.6 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EPWM0_BRAKE0 function is selected.
     * |[7]     |P1_MFP[7] |P1.7 Multi-Function Selection
     * |        |          |This bit selects P1.7 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EPWM1_BRAKE0 function is selected.
     * |[23:16] |P1_TYPEn  |P1[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P1[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P1[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P2_MFP
     * Offset: 0x38  P2 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P2_MFP[0] |P2.0 Multi-Function Selection
     * |        |          |This bit combined with P2_ALT[0] selects P2.0 multi-function.
     * |        |          |(P2_ALT[0], P2_MFP[0]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = SPI2_MOSI function is selected.
     * |        |          |(1, 0) = ACMP2_O function is selected.
     * |[1]     |P2_MFP[1] |P2.1 Multi-Function Selection
     * |        |          |This bit selects P2.1 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ECAP0_IC2 function is selected.
     * |[2]     |P2_MFP[2] |P2.2 Multi-Function Selection
     * |        |          |This bit selects P2.2 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ECAP0_IC1 function is selected.
     * |[3]     |P2_MFP[3] |P2.3 Multi-Function Selection
     * |        |          |This bit selects P2.3 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ECAP0_IC0 function is selected.
     * |[4]     |P2_MFP[4] |P2.4 Multi-Function Selection
     * |        |          |This bit selects P2.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = Reserved.
     * |[5]     |P2_MFP[5] |P2.5 Multi-Function Selection
     * |        |          |This bit selects P2.5 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = Reserved.
     * |[6]     |P2_MFP[6] |P2.6 Multi-Function Selection
     * |        |          |This bit combined with P2_ALT[6] selects P2.6 multi-function.
     * |        |          |(P2_ALT[6], P2_MFP[6]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = Reserved.
     * |        |          |(1, 0) = SPI0_SS function is selected.
     * |        |          |(1, 1) = UART1_nCTS function is selected.
     * |[7]     |P2_MFP[7] |P2.7 Multi-Function Selection
     * |        |          |This bit combined with P2_ALT[7] selects P2.7 multi-function.
     * |        |          |(P2_ALT[7], P2_MFP[7]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(1, 0) = SPI0_CLK function is selected.
     * |        |          |(1, 1) = UART1_nRTS function is selected.
     * |[8]     |P2_ALT[0] |P2.0 Alternative Function
     * |        |          |See P2_MFP[0].
     * |[14]    |P2_ALT[6] |P2.6 Alternative Function
     * |        |          |See P2_MFP[6].
     * |[15]    |P2_ALT[7] |P2.7 Alternative Function
     * |        |          |See P2_MFP[7].
     * |[23:16] |P2_TYPEn  |P2[7:0] Input Schmitt Trigger Function Enable
     * |        |          |0 = P2[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P2[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P3_MFP
     * Offset: 0x3C  P3 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P3_MFP[0] |P3.0 Multi-Function Selection
     * |        |          |This bit combined with P3_ALT[0] selects P3.0 multi-function.
     * |        |          |(P3_ALT[0], P3_MFP[0]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART0_RXD function is selected.
     * |        |          |(1, 0) = CLKO function is selected.
     * |[1]     |P3_MFP[1] |P3.1 Multi-Function Selection
     * |        |          |This bit combined with P3_ALT[1] selects P3.1 multi-function.
     * |        |          |(P3_ALT[1], P3_MFP[1]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = UART0_TXD function is selected.
     * |        |          |(1, 0) = ACMP0_O function is selected.
     * |[2]     |P3_MFP[2] |P3.2 Multi-Function Selection
     * |        |          |This bit selects P3.2 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = INT0 function is selected.
     * |[3]     |P3_MFP[3] |P3.3 Multi-Function Selection
     * |        |          |This bit selects P3.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = INT1 function is selected.
     * |[4]     |P3_MFP[4] |P3.4 Multi-Function Selection
     * |        |          |This bit combined with P3_ALT[4] selects P3.4 multi-function.
     * |        |          |(P3_ALT[4], P3_MFP[4]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = TM0 function is selected.
     * |        |          |(1, 0) = I2C0_SDA function is selected.
     * |[5]     |P3_MFP[5] |P3.5 Multi-Function Selection
     * |        |          |This bit combined with P3_ALT[5] selects P3.5 multi-function.
     * |        |          |(P3_ALT[5], P3_MFP[5]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = TM1 function is selected.
     * |        |          |(1, 0) = I2C0_SCL function is selected.
     * |[8]     |P3_ALT[0] |P3.0 Alternative Function
     * |        |          |See P3_MFP[0].
     * |[9]     |P3_ALT[1] |P3.1 Alternative Function
     * |        |          |See P3_MFP[1].
     * |[12]    |P3_ALT[4] |P3.4 Alternative Function
     * |        |          |See P3_MFP4].
     * |[13]    |P3_ALT[5] |P3.5 Alternative Function
     * |        |          |See P3_MFP[5].
     * |[23:16] |P3_TYPEn  |P3[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P3[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P3[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P4_MFP
     * Offset: 0x40  P4 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P4_MFP[0] |P4.0 Multi-Function Selection
     * |        |          |This bit selects P4.0 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ECAP1_IC0 function is selected.
     * |[1]     |P4_MFP[1] |P4.1 Multi-Function Selection
     * |        |          |This bit selects P4.1 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ECAP1_IC1 function is selected.
     * |[2]     |P4_MFP[2] |P4.2 Multi-Function Selection
     * |        |          |This bit selects P4.2 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ECAP1_IC2 function is selected.
     * |[4]     |P4_MFP[4] |P4.4 Multi-Function Selection
     * |        |          |This bit selects P4.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = Reserved.
     * |[5]     |P4_MFP[5] |P4.5 Multi-Function Selection
     * |        |          |This bit selects P4.5 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = Reserved.
     * |[6]     |P4_MFP[6] |P4.6 Multi-Function Selection
     * |        |          |This bit combined with P4_ALT[6] selects P4.6 multi-function.
     * |        |          |(P4_ALT[6], P4_MFP[6]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIO function is selected.
     * |        |          |(0, 1) = TM2 function is selected.
     * |        |          |(1, 0) = Reserved.
     * |[7]     |P4_MFP[7] |P4.7 Multi-Function Selection
     * |        |          |This bit selects P4.7 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = TM3 function is selected.
     * |[14]    |P4_ALT[6] |P4.6 Alternative Function
     * |        |          |See P4_MFP[6].
     * |[23:16] |P4_TYPEn  |P4[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P4[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P4[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P5_MFP
     * Offset: 0x44  P5 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P5_MFP[0] |P5.0 Multi-Function Selection
     * |        |          |This bit combined with P5_ALT[0] selects P5.0 multi-function.
     * |        |          |(P5_ALT[0], P5_MFP[0]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIIO function is selected.
     * |        |          |(0, 1) = SPI0_MOSI function is selected.
     * |        |          |(1, 0) = UART0_nRTS function is selected.
     * |        |          |(1, 1) = I2C0_SCL function is selected.
     * |[1]     |P5_MFP[1] |P5.1 Multi-Function Selection
     * |        |          |This bit combined with P5_ALT[1] selects P5.1 multi-function.
     * |        |          |(P5_ALT[1], P5_MFP[1]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIIO function is selected.
     * |        |          |(0, 1) = SPI0_MISO function is selected.
     * |        |          |(1, 0) = UART0_nCTS function is selected.
     * |        |          |(1, 1) = I2C0_SDA function is selected.
     * |[2]     |P5_MFP[2] |P5.2 Multi-Function Selection
     * |        |          |This bit combined with P5_ALT[2] selects P5.2 multi-function.
     * |        |          |(P5_ALT[2], P5_MFP[2]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIIO function is selected.
     * |        |          |(0, 1) = SPI2_MISO function is selected.
     * |        |          |(1, 0) = ACMP1_O function is selected.
     * |[3]     |P5_MFP[3] |P5.3 Multi-Function Selection
     * |        |          |This bit selects P5.3 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = SPI2_CLK function is selected.
     * |[4]     |P5_MFP[4] |P5.4 Multi-Function Selection
     * |        |          |This bit selects P5.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = SPI2_SS function is selected.
     * |[5]     |P5_MFP[5] |P5.5 Multi-Function Selection
     * |        |          |This bit selects P5.5 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = CLKO function is selected.
     * |[6]     |P5_MFP[6] |P5.6 Multi-Function Selection
     * |        |          |This bit selects P5.6 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = BPWM0_CH0 function is selected.
     * |[7]     |P5_MFP[7] |P5.7 Multi-Function Selection
     * |        |          |This bit selects P5.7 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = BPWM0_CH1 function is selected.
     * |[8]     |P5_ALT[0] |P5.0 Alternative Function
     * |        |          |See P5_MFP[0].
     * |[9]     |P5_ALT[1] |P5.1 Alternative Function
     * |        |          |See P5_MFP[1].
     * |[10]    |P5_ALT[2] |P5.2 Alternative Function
     * |        |          |See P5_MFP[2].
     * |[23:16] |P5_TYPEn  |P5[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P5[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P5[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P6_MFP
     * Offset: 0x48  P6 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P6_MFP[0] |P6.0 Multi-Function Selection
     * |        |          |This bit selects P6.0 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH0 function is selected.
     * |[1]     |P6_MFP[1] |P6.1 Multi-Function Selection
     * |        |          |This bit selects P6.1 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH1 function is selected.
     * |[2]     |P6_MFP[2] |P6.2 Multi-Function Selection
     * |        |          |This bit selects P6.2 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH2 function is selected.
     * |[3]     |P6_MFP[3] |P6.3 Multi-Function Selection
     * |        |          |This bit selects P6.3 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH3 function is selected.
     * |[4]     |P6_MFP[4] |P6.4 Multi-Function Selection
     * |        |          |This bit selects P6.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH4 or ACMP1_N function is selected.
     * |[5]     |P6_MFP[5] |P6.5 Multi-Function Selection
     * |        |          |This bit selects P6.5 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH5 or ACMP1_P function is selected.
     * |[6]     |P6_MFP[6] |P6.6 Multi-Function Selection
     * |        |          |This bit selects P6.6 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH6 function is selected.
     * |[7]     |P6_MFP[7] |P6.7 Multi-Function Selection
     * |        |          |This bit selects P6.7 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC0_CH7 function is selected.
     * |[23:16] |P6_TYPEn  |P6[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P6[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P6[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P7_MFP
     * Offset: 0x4C  P7 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P7_MFP[0] |P7.0 Multi-Function Selection
     * |        |          |This bit selects P7.0 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH0 function is selected.
     * |[1]     |P7_MFP[1] |P7.1 Multi-Function Selection
     * |        |          |This bit selects P7.1 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH1 function is selected.
     * |[2]     |P7_MFP[2] |P7.2 Multi-Function Selection
     * |        |          |This bit selects P7.2 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH2 function is selected.
     * |[3]     |P7_MFP[3] |P7.3 Multi-Function Selection
     * |        |          |This bit selects P7.3 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH3 function is selected.
     * |[4]     |P7_MFP[4] |P7.4 Multi-Function Selection
     * |        |          |This bit selects P7.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH4 or ACMP2_N function is selected.
     * |[5]     |P7_MFP[5] |P7.5 Multi-Function Selection
     * |        |          |This bit selects P7.5 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH5 or ACMP2_N function is selected.
     * |[6]     |P7_MFP[6] |P7.6 Multi-Function Selection
     * |        |          |This bit selects P7.6 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH6 function is selected.
     * |[7]     |P7_MFP[7] |P7.7 Multi-Function Selection
     * |        |          |This bit selects P7.7 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EADC1_CH7 function is selected.
     * |[23:16] |P7_TYPEn  |P7[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P7[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P7[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P8_MFP
     * Offset: 0x50  P8 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P8_MFP[0] |P8.0 Multi-Function Selection
     * |        |          |This bit selects P8.0 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = OP0_P function is selected.
     * |[1]     |P8_MFP[1] |P8.1 Multi-Function Selection
     * |        |          |This bit selects P8.1 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = OP0_N function is selected.
     * |[2]     |P8_MFP[2] |P8.2 Multi-Function Selection
     * |        |          |This bit selects P8.2 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = OP0_O function is selected.
     * |[3]     |P8_MFP[3] |P8.3 Multi-Function Selection
     * |        |          |This bit selects P8.3 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ACMP0_N function is selected.
     * |[4]     |P8_MFP[4] |P8.4 Multi-Function Selection
     * |        |          |This bit selects P8.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ACMP0_P function is selected.
     * |[7]     |P8_MFP[7] |P8.7 Multi-Function Selection
     * |        |          |This bit selects P8.7 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = ACMP0_O function is selected.
     * |[23:16] |P8_TYPEn  |P8[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P8[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P8[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::P9_MFP
     * Offset: 0x54  P9 Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |P9_MFP[0] |P9.0 Multi-Function Selection
     * |        |          |This bit selects P9.0 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = OP1_O function is selected.
     * |[1]     |P9_MFP[1] |P9.1 Multi-Function Selection
     * |        |          |This bit selects P9.1 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = OP1_N function is selected.
     * |[2]     |P9_MFP[2] |P9.2 Multi-Function Selection
     * |        |          |This bit selects P9.2 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = OP1_P function is selected.
     * |[3]     |P9_MFP[3] |P9.3 Multi-Function Selection
     * |        |          |This bit selects P9.3 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = EPWM1_BRAKE1 function is selected.
     * |[4]     |P9_MFP[4] |P9.4 Multi-Function Selection
     * |        |          |This bit selects P9.4 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = SPI1_CLK function is selected.
     * |[5]     |P9_MFP[5] |P9.5 Multi-Function Selection
     * |        |          |This bit selects P9.5 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = SPI1_MISO function is selected.
     * |[6]     |P9_MFP[6] |P9.6 Multi-Function Selection
     * |        |          |This bit selects P9.6 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = SPI1_MOSI function is selected.
     * |[7]     |P9_MFP[7] |P9.7 Multi-Function Selection
     * |        |          |This bit selects P9.7 multi-function.
     * |        |          |0 = GPIO function is selected.
     * |        |          |1 = SPI1_SS function is selected.
     * |[23:16] |P9_TYPEn  |P9[7:0] Input Schmitt Trigger Function Enable Bits
     * |        |          |0 = P9[7:0] I/O input Schmitt Trigger function Disabled.
     * |        |          |1 = P9[7:0] I/O input Schmitt Trigger function Enabled.
     * @var GCR_T::PA_MFP
     * Offset: 0x58  PA Multiple Function and Input Type Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PA_MFP[0] |PA.0 Multi-Function Selection
     * |        |          |This bit combined with PA_ALT[0] selects PA.0 multi-function.
     * |        |          |(PA_ALT[0], PA_MFP[0]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIIO function is selected.
     * |        |          |(0, 1) = UART1_TXD function is selected.
     * |        |          |(1, 1) = I2C0_SDA function is selected.
     * |[1]     |PA_MFP[1] |PA.1 Multi-Function Selection
     * |        |          |This bit combined with PA_ALT[1] selects PA.1 multi-function.
     * |        |          |(PA_ALT[1], PA_MFP[1]) value and function mapping is as following list.
     * |        |          |(0, 0) = GPIIO function is selected.
