OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
} TIMER_T;



/**
    @addtogroup TIMER_CONST TMR Bit Field Definition
    Constant Definitions for TMR Controller
@{ */

/* TIMER TCSR Bit Field Definitions */
#define TIMER_TCSR_DBGACK_TMR_Pos   31                                          /*!< TIMER_T::TCSR: DBGACK_TMR Position */
#define TIMER_TCSR_DBGACK_TMR_Msk   (1ul << TIMER_TCSR_DBGACK_TMR_Pos)          /*!< TIMER_T::TCSR: DBGACK_TMR Mask */

#define TIMER_TCSR_CEN_Pos          30                                          /*!< TIMER_T::TCSR: CEN Position */
#define TIMER_TCSR_CEN_Msk          (1ul << TIMER_TCSR_CEN_Pos)                 /*!< TIMER_T::TCSR: CEN Mask */

#define TIMER_TCSR_IE_Pos           29                                          /*!< TIMER_T::TCSR: IE Position */
#define TIMER_TCSR_IE_Msk           (1ul << TIMER_TCSR_IE_Pos)                  /*!< TIMER_T::TCSR: IE Mask */

#define TIMER_TCSR_MODE_Pos         27                                          /*!< TIMER_T::TCSR: MODE Position */
#define TIMER_TCSR_MODE_Msk         (0x3ul << TIMER_TCSR_MODE_Pos)              /*!< TIMER_T::TCSR: MODE Mask */

#define TIMER_TCSR_CRST_Pos         26                                          /*!< TIMER_T::TCSR: CRST Position */
#define TIMER_TCSR_CRST_Msk         (1ul << TIMER_TCSR_CRST_Pos)                /*!< TIMER_T::TCSR: CRST Mask */

#define TIMER_TCSR_CACT_Pos         25                                          /*!< TIMER_T::TCSR: CACT Position */
#define TIMER_TCSR_CACT_Msk         (1ul << TIMER_TCSR_CACT_Pos)                /*!< TIMER_T::TCSR: CACT Mask */

#define TIMER_TCSR_CTB_Pos          24                                          /*!< TIMER_T::TCSR: CTB Position */
#define TIMER_TCSR_CTB_Msk          (1ul << TIMER_TCSR_CTB_Pos)                 /*!< TIMER_T::TCSR: CTB Mask */

#define TIMER_TCSR_TDR_EN_Pos       16                                          /*!< TIMER_T::TCSR: TDR_EN Position */
#define TIMER_TCSR_TDR_EN_Msk       (1ul << TIMER_TCSR_TDR_EN_Pos)              /*!< TIMER_T::TCSR: TDR_EN Mask */

#define TIMER_TCSR_PRESCALE_Pos     0                                           /*!< TIMER_T::TCSR: PRESCALE Position */
#define TIMER_TCSR_PRESCALE_Msk     (0xFFul << TIMER_TCSR_PRESCALE_Pos)         /*!< TIMER_T::TCSR: PRESCALE Mask */

/* TIMER TCMPR Bit Field Definitions */
#define TIMER_TCMP_TCMP_Pos         0                                           /*!< TIMER_T::TCMPR: TCMP Position */
#define TIMER_TCMP_TCMP_Msk         (0xFFFFFFul << TIMER_TCMP_TCMP_Pos)         /*!< TIMER_T::TCMPR: TCMP Mask */

/* TIMER TISR Bit Field Definitions */
#define TIMER_TISR_TIF_Pos          0                                           /*!< TIMER_T::TISR: TIF Position */
#define TIMER_TISR_TIF_Msk          (1ul << TIMER_TISR_TIF_Pos)                 /*!< TIMER_T::TISR: TIF Mask */

/* TIMER TDR Bit Field Definitions */
#define TIMER_TDR_TDR_Pos           0                                           /*!< TIMER_T::TDR: TDR Position */
#define TIMER_TDR_TDR_Msk           (0xFFFFFFul << TIMER_TDR_TDR_Pos)           /*!< TIMER_T::TDR: TDR Mask */

/* TIMER TCAP Bit Field Definitions */
#define TIMER_TCAP_TCAP_Pos         0                                           /*!< TIMER_T::TCAP: TCAP Position */
#define TIMER_TCAP_TCAP_Msk         (0xFFFFFFul << TIMER_TCAP_TCAP_Pos)         /*!< TIMER_T::TCAP: TCAP Mask */

/* TIMER TEXCON Bit Field Definitions */
#define TIMER_TEXCON_TCDB_Pos       7                                           /*!< TIMER_T::TEXCON: TCDB Position */
#define TIMER_TEXCON_TCDB_Msk       (1ul << TIMER_TEXCON_TCDB_Pos)              /*!< TIMER_T::TEXCON: TCDB Mask */

#define TIMER_TEXCON_TEXDB_Pos      6                                           /*!< TIMER_T::TEXCON: TEXDB Position */
#define TIMER_TEXCON_TEXDB_Msk      (1ul << TIMER_TEXCON_TEXDB_Pos)             /*!< TIMER_T::TEXCON: TEXDB Mask */

#define TIMER_TEXCON_TEXIEN_Pos     5                                           /*!< TIMER_T::TEXCON: TEXIEN Position */
#define TIMER_TEXCON_TEXIEN_Msk     (1ul << TIMER_TEXCON_TEXIEN_Pos)            /*!< TIMER_T::TEXCON: TEXIEN Mask */

#define TIMER_TEXCON_RSTCAPSEL_Pos  4                                           /*!< TIMER_T::TEXCON: RSTCAPSEL Position */
#define TIMER_TEXCON_RSTCAPSEL_Msk  (1ul << TIMER_TEXCON_RSTCAPSEL_Pos)         /*!< TIMER_T::TEXCON: RSTCAPSEL Mask */

#define TIMER_TEXCON_TEXEN_Pos      3                                           /*!< TIMER_T::TEXCON: TEXEN Position */
#define TIMER_TEXCON_TEXEN_Msk      (1ul << TIMER_TEXCON_TEXEN_Pos)             /*!< TIMER_T::TEXCON: TEXEN Mask */

#define TIMER_TEXCON_TEX_EDGE_Pos   1                                           /*!< TIMER_T::TEXCON: TEX_EDGE Position */
#define TIMER_TEXCON_TEX_EDGE_Msk   (0x3ul << TIMER_TEXCON_TEX_EDGE_Pos)        /*!< TIMER_T::TEXCON: TEX_EDGE Mask */

#define TIMER_TEXCON_TX_PHASE_Pos   0                                           /*!< TIMER_T::TEXCON: TX_PHASE Position */
#define TIMER_TEXCON_TX_PHASE_Msk   (1ul << TIMER_TEXCON_TX_PHASE_Pos)          /*!< TIMER_T::TEXCON: TX_PHASE Mask */

/* TIMER TEXISR Bit Field Definitions */
#define TIMER_TEXISR_TEXIF_Pos      0                                           /*!< TIMER_T::TEXISR: TEXIF Position */
#define TIMER_TEXISR_TEXIF_Msk      (1ul << TIMER_TEXISR_TEXIF_Pos)             /*!< TIMER_T::TEXISR: TEXIF Mask */
/*@}*/ /* end of group TIMER_CONST */
/*@}*/ /* end of group TIMER */



/*---------------------- Universal Asynchronous Receiver/Transmitter Controller -------------------------*/
/**
    @addtogroup UART Universal Asynchronous Receiver/Transmitter Controller (UART)
    Memory Mapped Structure for UART Controller
@{ */

typedef struct
{


    /**
    * @var UART_T::DATA
    * Offset: 0x00  UART Data Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[7:0]   |DATA      |UART Data Register
    * |        |          |By writing one byte to this register, the data byte will be stored in transmitter FIFO. 
    * |        |          |The UART Controller will send out the data stored in transmitter FIFO top location through the UART_TXD pin (LSB first). 
    * |        |          |By reading this register, the UART will return an 8-bit data received from UART_RXD pin (LSB first).
    * @var UART_T::THR
    * Offset: 0x00  UART Transmit Holding Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[7:0]   |THR       |Transmit Holding Register
    * |        |          |By writing one byte to this register, the data byte will be stored in transmitter FIFO. 
    * |        |          |The UART Controller will send out the data stored in transmitter FIFO top location through the UART_TXD pin (LSB first). 
    * @var UART_T::RBR
    * Offset: 0x00  UART Receive Buffer Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[7:0]   |RBR       |Receive Buffer Register (Read Only)
    * |        |          |By reading this register, the UART will return an 8-bit data received from UART_RXD pin (LSB first).
    * @var UART_T::IER
    * Offset: 0x04  UART Interrupt Enable Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |RDA_IEN   |Receive Data Available Interrupt Enable Bit
    * |        |          |0 = Receive data available interrupt Disabled.
    * |        |          |1 = Receive data available interrupt Enabled.
    * |[1]     |THRE_IEN  |Transmit Holding Register Empty Interrupt Enable Bit
    * |        |          |0 = Transmit holding register empty interrupt Disabled.
    * |        |          |1 = Transmit holding register empty interrupt Enabled.
    * |[2]     |RLS_IEN   |Receive Line Status Interrupt Enable Bit
    * |        |          |0 = Receive Line Status interrupt Disabled.
    * |        |          |1 = Receive Line Status interrupt Enabled.
    * |[3]     |MODEM_IEN |Modem Status Interrupt Enable Bit
    * |        |          |0 = Modem status interrupt Disabled.
    * |        |          |1 = Modem status interrupt Enabled.
    * |[4]     |TOUT_IEN  |RX Time-out Interrupt Enable Bit
    * |        |          |0 = RX time-out interrupt Disabled.
    * |        |          |1 = RX time-out interrupt Enabled.
    * |[5]     |BUF_ERR_IEN|Buffer Error Interrupt Enable Bit
    * |        |          |0 = Buffer error interrupt Disabled.
    * |        |          |1 = Buffer error interrupt Enabled.
    * |[6]     |WAKE_EN   |UART Wake-up Function Enable Bit
    * |        |          |0 = UART wake-up function Disabled.
    * |        |          |1 = UART wake-up function Enabled, when chip is in Power-down mode, an external nCTS change will wake up chip from Power-down mode.
    * |[8]     |LIN_IEN   |LIN Bus Interrupt Enable Bit
    * |        |          |0 = Lin bus interrupt Disabled.
    * |        |          |1 = Lin bus interrupt Enabled.
    * |        |          |Note: This field is used for LIN function mode.
    * |[11]    |TIME_OUT_EN|Receive Buffer Time-out Counter Enable
    * |        |          |0 = Receive Buffer Time-out counter Disabled.
    * |        |          |1 = Receive Buffer Time-out counter Enabled.
    * |[12]    |AUTO_RTS_EN|nRTS Auto Flow Control Enable
    * |        |          |0 = nRTS auto flow control Disabled.
    * |        |          |1 = nRTS auto flow control Enabled.
    * |        |          |When nRTS auto-flow is enabled, if the number of bytes in the RX FIFO equals the RTS_TRI_LEV (UA_FCR[19:16]), the UART will de-assert nRTS signal.
    * |[13]    |AUTO_CTS_EN|nCTS Auto Flow Control Enable
    * |        |          |0 = nCTS auto flow control Disabled.
    * |        |          |1 = nCTS auto flow control Enabled.
    * |        |          |When nCTS auto-flow is enabled, the UART will send data to external device when nCTS input assert (UART will not send data to device until nCTS is asserted).
    * @var UART_T::FCR
    * Offset: 0x08  UART FIFO Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[1]     |RFR       |RX Field Software Reset
    * |        |          |When RFR is set, all the byte in the receiver FIFO and RX internal state machine are cleared.
    * |        |          |0 = No effect.
    * |        |          |1 = Reset the RX internal state machine and pointers.
    * |        |          |Note: This bit will automatically clear at least 3 UART peripheral clock cycles.
    * |[2]     |TFR       |TX Field Software Reset
    * |        |          |When TFR is set, all the byte in the transmit FIFO and TX internal state machine are cleared.
    * |        |          |0 = No effect.
    * |        |          |1 = Reset the TX internal state machine and pointers.
    * |        |          |Note: This bit will automatically clear at least 3 UART peripheral clock cycles.
    * |[7:4]   |RFITL     |RX FIFO Interrupt Trigger Level
    * |        |          |When the number of bytes in the receive FIFO equals the RFITL, the RDA_IF (UA_ISR[0]) will be set (if RDA_IEN (UA_IER[0] enabled, and an interrupt will be generated).
    * |        |          |0000 = RX FIFO Interrupt Trigger Level is 1 byte.
    * |        |          |0001 = RX FIFO Interrupt Trigger Level is 4 bytes.
    * |        |          |0010 = RX FIFO Interrupt Trigger Level is 8 bytes.
    * |        |          |0011 = RX FIFO Interrupt Trigger Level is 14 bytes.
    * |        |          |Others = Reserved.
    * |[8]     |RX_DIS    |Receiver Disable Bit
    * |        |          |The receiver is disabled or not (set 1 to disable receiver).
    * |        |          |0 = Receiver Enabled.
    * |        |          |1 = Receiver Disabled.
    * |        |          |Note: This field is used for RS-485 Normal Multi-drop mode. It should be programmed before RS485_NMM (UA_ALT_CSR[8]) is programmed.
    * |[19:16] |RTS_TRI_LEV|nRTS Trigger Level For Auto-flow Control Use
    * |        |          |0000 = RTS Trigger Level is 1 byte.
    * |        |          |0001 = RTS Trigger Level is 4 bytes.
    * |        |          |0010 = RTS Trigger Level is 8 bytes.
    * |        |          |0011 = RTS Trigger Level is 14 bytes.
    * |        |          |Others = Reserved.
    * |        |          |Note: This field is used for nRTS auto-flow control.
    * @var UART_T::LCR
    * Offset: 0x0C  UART Line Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[1:0]   |WLS       |Word Length Selection
    * |        |          |00 = Word length is 5-bit.
    * |        |          |01 = Word length is 6-bit.
    * |        |          |10 = Word length is 7-bit
    * |        |          |11 = Word length is 8-bit
    * |[2]     |NSB       |Number Of "STOP Bit"
    * |        |          |0 = One " STOP bit" is generated in the transmitted data.
    * |        |          |1 = When select 5-bit word length, 1.5 "STOP bit" is generated in the transmitted data.
    * |        |          |When select 6-,7- and 8-bit word length, 2 "STOP bit" is generated in the transmitted data.
    * |[3]     |PBE       |Parity Bit Enable Bit
    * |        |          |0 = No parity bit.
    * |        |          |1 = Parity bit is generated on each outgoing character and is checked on each incoming data.
    * |[4]     |EPE       |Even Parity Enable Bit
    * |        |          |0 = Odd number of logic 1's is transmitted and checked in each word.
    * |        |          |1 = Even number of logic 1's is transmitted and checked in each word.
    * |        |          |This bit has effect only when PBE (UA_LCR[3]) is set.
    * |[5]     |SPE       |Stick Parity Enable Bit
    * |        |          |0 = Stick parity Disabled.
    * |        |          |1 = If PBE (UA_LCR[3]) and EBE (UA_LCR[4]) are logic 1, the parity bit is transmitted and checked as logic 0.
    * |        |          |If PBE (UA_LCR[3]) is 1 and EBE (UA_LCR[4]) is 0 then the parity bit is transmitted and checked as 1.
    * |[6]     |BCB       |Break Control Bit
    * |        |          |When this bit is set to logic 1, the serial data output (TX) is forced to the Spacing State (logic 0).
    * |        |          |This bit acts only on TX and has no effect on the transmitter logic.
    * @var UART_T::MCR
    * Offset: 0x10  UART Modem Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[1]     |RTS       |nRTS (Request-to-send) Signal Control
    * |        |          |This bit is direct control internal nRTS signal active or not, and then drive the nRTS pin output with LEV_RTS bit configuration.
    * |        |          |0 = nRTS signal is active.
    * |        |          |1 = nRTS signal is inactive.
    * |        |          |Note1: This nRTS signal control bit is not effective when RTS auto-flow control is enabled in UART function mode.
    * |        |          |Note2: This nRTS signal control bit is not effective when RS-485 auto direction mode (AUD) is enabled in RS-485 function mode.
    * |[9]     |LEV_RTS   |nRTS Pin Active Level
    * |        |          |This bit defines the active level state of nRTS pin output.
    * |        |          |0 = nRTS pin output is high level active.
    * |        |          |1 = nRTS pin output is low level active.
    * |[13]    |RTS_ST    |nRTS Pin State (Read Only)
    * |        |          |This bit mirror from nRTS pin output of voltage logic status.
    * |        |          |0 = nRTS pin output is low level voltage logic state.
    * |        |          |1 = nRTS pin output is high level voltage logic state.
    * @var UART_T::MSR
    * Offset: 0x14  UART Modem Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |DCTSF     |Detect nCTS State Change Flag
    * |        |          |This bit is set whenever nCTS input has change state, and it will generate Modem interrupt to CPU when MODEM_IEN (UA_IER[3]) is set to 1.
    * |        |          |0 = nCTS input has not change state.
    * |        |          |1 = nCTS input has change state.
    * |        |          |Note: This bit can be cleared by writing "1" to it.
    * |[4]     |CTS_ST    |nCTS Pin Status (Read Only)
    * |        |          |This bit mirror from nCTS pin input of voltage logic status.
    * |        |          |0 = nCTS pin input is low level voltage logic state.
    * |        |          |1 = nCTS pin input is high level voltage logic state.
    * |        |          |Note: This bit echoes when UART Controller peripheral clock is enabled, and nCTS multi-function port is selected.
    * |[8]     |LEV_CTS   |nCTS Pin Active Level
    * |        |          |This bit defines the active level state of nCTS pin input.
    * |        |          |0 = nCTS pin input is high level active.
    * |        |          |1 = nCTS pin input is low level active.
    * @var UART_T::FSR
    * Offset: 0x18  UART FIFO Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |RX_OVER_IF|RX Overflow Error Interrupt Flag
    * |        |          |This bit is set when RX FIFO overflow.
    * |        |          |If the number of bytes of received data is greater than RX_FIFO (UA_RBR) size, this bit will be set.
    * |        |          |0 = RX FIFO is not overflow.
    * |        |          |1 = RX FIFO is overflow.
    * |        |          |Note: This bit can be cleared by writing "1" to it.
    * |[3]     |RS485_ADD_DETF|RS-485 Address Byte Detection Flag
    * |        |          |0 = Receiver detects a data that is not an address byte (bit 9 = "0").
    * |        |          |1 = Receiver detects a data that is an address byte (bit 9 = "1").
    * |        |          |Note1: This field is used for RS-485 function mode and RS485_ADD_EN (UA_ALT_CSR[15]) is set to 1 to enable Address detection mode.
    * |        |          |Note2: This bit can be cleared by writing "1" to it.
    * |[4]     |PEF       |Parity Error Flag
    * |        |          |This bit is set to logic 1 whenever the received character does not have a valid "parity bit", and is reset whenever the CPU writes 1 to this bit.
    * |        |          |0 = No parity error is generated.
    * |        |          |1 = Parity error is generated.
    * |        |          |Note: This bit can be cleared by writing "1" to it.
    * |[5]     |FEF       |Framing Error Flag
    * |        |          |This bit is set to logic 1 whenever the received character does not have a valid "stop bit" (that is, the stop bit following the last data bit or parity bit is detected as logic 0), and is reset whenever the CPU writes 1 to this bit.
    * |        |          |0 = No framing error is generated.
    * |        |          |1 = Framing error is generated.
    * |        |          |Note: This bit can be cleared by writing "1" to it.
    * |[6]     |BIF       |Break Interrupt Flag
    * |        |          |This bit is set to logic 1 whenever the received data input(RX) is held in the "spacing state" (logic 0) for longer than a full word transmission time (that is, the total time of "start bit" + data bits + parity + stop bits) and is reset whenever the CPU writes 1 to this bit.
    * |        |          |0 = No Break interrupt is generated.
    * |        |          |1 = Break interrupt is generated.
    * |        |          |Note: This bit can be cleared by writing "1" to it.
    * |[13:8]  |RX_POINTER|RX FIFO Pointer (Read Only)
    * |        |          |This field indicates the RX FIFO Buffer Pointer. When UART receives one byte from external device, RX_POINTER increases one. When one byte of RX FIFO is read by CPU, RX_POINTER decreases one.
    * |        |          |The Maximum value shown in RX_POINTER is 15. When the using level of RX FIFO Buffer equal to 16, the RX_FULL bit is set to 1 and RXPTR will show 0. As one byte of RX FIFO is read by CPU, the RX_FULL bit is cleared to 0 and RX_POINTER will show 15.
    * |[14]    |RX_EMPTY  |Receiver FIFO Empty (Read Only)
    * |        |          |This bit initiate RX FIFO empty or not.
    * |        |          |0 = RX FIFO is not empty.
    * |        |          |1 = RX FIFO is empty.
    * |        |          |Note: When the last byte of RX FIFO has been read by CPU, hardware sets this bit high. It will be cleared when UART receives any new data.
    * |[15]    |RX_FULL   |Receiver FIFO Full (Read Only)
    * |        |          |This bit indicates RX FIFO full or not.
    * |        |          |0 = RX FIFO is not full.
    * |        |          |1 = RX FIFO is full.
    * |        |          |Note: This bit is set when the using level of RX FIFO Buffer equal to 16; otherwise, it is cleared by hardware.
    * |[21:16] |TX_POINTER|TX FIFO Pointer (Read Only)
    * |        |          |This field indicates the TX FIFO Buffer Pointer. When CPU writes one byte into UA_THR, TX_POINTER increases one. When one byte of TX FIFO is transferred to Transmitter Shift Register, TX_POINTER decreases one.
    * |        |          |The Maximum value shown in TX_POINTER is 15. When the using level of TX FIFO Buffer equal to 16, the TX_FULL bit is set to 1 and TX_POINTER will show 0. As one byte of TX FIFO is transferred to Transmitter Shift Register, the TX_FULL bit is cleared to 0 and TX_POINTER will show 15.
    * |[22]    |TX_EMPTY  |Transmitter FIFO Empty (Read Only)
    * |        |          |This bit indicates TX FIFO is empty or not.
    * |        |          |0 = TX FIFO is not empty.
    * |        |          |1 = TX FIFO is empty.
    * |        |          |Note: When the last byte of TX FIFO has been transferred to Transmitter Shift Register, hardware sets this bit high. It will be cleared when writing data into UA_THR (TX FIFO not empty).
    * |[23]    |TX_FULL   |Transmitter FIFO Full (Read Only)
    * |        |          |This bit indicates TX FIFO full or not.
    * |        |          |0 = TX FIFO is not full.
    * |        |          |1 = TX FIFO is full.
    * |        |          |Note: This bit is set when the using level of TX FIFO Buffer equal to 16; otherwise, it is cleared by hardware.
    * |[24]    |TX_OVER_IF|Tx Overflow Error Interrupt Flag
    * |        |          |If TX FIFO (UA_THR) is full, an additional write to UA_THR will cause this bit to logic 1.
    * |        |          |0 = TX FIFO is not overflow.
    * |        |          |1 = TX FIFO is overflow.
    * |        |          |Note: This bit can be cleared by writing "1" to it.
    * |[28]    |TE_FLAG   |Transmitter Empty Flag (Read Only)
    * |        |          |This bit is set by hardware when TX FIFO (UA_THR) is empty and the STOP bit of the last byte has been transmitted.
    * |        |          |0 = TX FIFO is not empty or the STOP bit of the last byte has been not transmitted.
    * |        |          |1 = TX FIFO is empty and the STOP bit of the last byte has been transmitted.
