OpenNuvoton/ISPTool/Firmwares/M0519BSPv3/Library/Device/Nuvoton/M0519/Include/M0519.h
    * |        |          |Note: This bit is cleared automatically when TX FIFO is not empty or the last byte transmission has not completed.
    * @var UART_T::ISR
    * Offset: 0x1C  UART Interrupt Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |RDA_IF    |Receive Data Available Interrupt Flag (Read Only)
    * |        |          |When the number of bytes in the RX FIFO equals the RFITL (UA_FCR[7:4]) then the RDA_IF (UA_ISR[0]) will be set.
    * |        |          |If RDA_IEN (UA_IER[0]) is enabled, the RDA interrupt will be generated.
    * |        |          |0 = No RDA interrupt flag is generated.
    * |        |          |1 = RDA interrupt flag is generated.
    * |        |          |Note: This bit is read only and it will be cleared when the number of unread bytes of RX FIFO drops below the threshold level RFITL (UA_FCR[7:4]).
    * |[1]     |THRE_IF   |Transmit Holding Register Empty Interrupt Flag (Read Only)
    * |        |          |This bit is set when the last data of TX FIFO is transferred to Transmitter Shift Register.
    * |        |          |If THRE_IEN (UA_IER[1]) is enabled, the THRE interrupt will be generated.
    * |        |          |0 = No THRE interrupt flag is generated.
    * |        |          |1 = THRE interrupt flag is generated.
    * |        |          |Note: This bit is read only and it will be cleared when writing data into THR (TX FIFO not empty).
    * |[2]     |RLS_IF    |Receive Line Interrupt Flag (Read Only)
    * |        |          |This bit is set when the RX receive data have parity error, frame error or break error (at least one of 3 bits, BIF(UA_FSR[6]), FEF(UA_FSR[5]) and PEF(UA_FSR[4]), is set).
    * |        |          |If RLS_IEN (UA_IER [2]) is enabled, the RLS interrupt will be generated.
    * |        |          |0 = No RLS interrupt flag is generated.
    * |        |          |1 = RLS interrupt flag is generated.
    * |        |          |Note1: In RS-485 function mode, this field is set include receiver detect and received address byte character (bit9 = '1') bit. At the same time, the bit of RS485_ADD_DETF (UA_FSR[3]) is also set.
    * |        |          |Note2: This bit is read only and reset to 0 when all bits of BIF (UA_FSR[6]), FEF (UA_FSR[5]) and PEF (UA_FSR[4]) are cleared.
    * |        |          |Note3: In RS-485 function mode, this bit is read only and reset to 0 when all bits of BIF (UA_FSR[6]) , FEF (UA_FSR[5]) and PEF (UA_FSR[4]) and RS485_ADD_DETF (UA_FSR[3]) are cleared.
    * |[3]     |MODEM_IF  |MODEM Interrupt Flag (Read Only)
    * |        |          |This bit is set when the nCTS pin has state change (DCTSF (UA_MSR[0]) = 1).
    * |        |          |If MODEM_IEN (UA_IER[3]) is enabled, the Modem interrupt will be generated.
    * |        |          |0 = No Modem interrupt flag is generated.
    * |        |          |1 = Modem interrupt flag is generated.
    * |        |          |Note: This bit is reset to 0 when bit DCTSF (UA_MSR[0]) is cleared by a write 1 on DCTSF (UA_MSR[0]).
    * |[4]     |TOUT_IF   |Rx Time-out Interrupt Flag (Read Only)
    * |        |          |This bit is set when the RX FIFO is not empty and no activities occurred in the RX FIFO and the time-out counter equal to TOIC (UA_TOR[7:0]).
    * |        |          |If TOUT_IEN (UA_IER[4]) is enabled, the Rx Time-out interrupt will be generated.
    * |        |          |0 = No Rx Time-out interrupt flag is generated.
    * |        |          |1 = Rx Time-out interrupt flag is generated.
    * |        |          |Note: This bit is read only and user can read UA_RBR (RX is in active) to clear it
    * |[5]     |BUF_ERR_IF|Buffer Error Interrupt Flag (Read Only)
    * |        |          |This bit is set when the TX FIFO or RX FIFO overflows (TX_OVER_IF (UA_FSR[24]) or RX_OVER_IF (UA_FSR[0]) is set).
    * |        |          |When BUF_ERR_IF (UA_ISR[5]) is set, the transfer is not correct.
    * |        |          |If BUF_ERR_IEN (UA_IER[8]) is enabled, the buffer error interrupt will be generated.
    * |        |          |0 = No buffer error interrupt flag is generated.
    * |        |          |1 = Buffer error interrupt flag is generated.
    * |        |          |Note: This bit is read only and reset to 0 when all bits of TX_OVER_IF (UA_FSR[24]) and RX_OVER_IF (UA_FSR[0]) are cleared.
    * |[7]     |LIN_IF    |LIN Bus Interrupt Flag (Read Only)
    * |        |          |This bit is set when LIN slave header detect (LINS_HDET_F (UA_LIN_SR[0]) = 1), LIN break detect (LIN_BKDET_F (UA_LIN_SR[8]) = 1), bit error detect (BIT_ERR_F (UA_LIN_SR[9]) = 1), LIN slave ID parity error (LINS_IDPERR_F (UA_LIN_SR[2]) = 1) or LIN slave header error detect (LINS_HERR_F (UA_LIN_SR[1]) = 1). 
    * |        |          |If LIN_IEN (UA_IER[8]) is enabled the LIN interrupt will be generated.    
    * |        |          |0 = None of LINS_HDET_F, LIN_BKDET_F, BIT_ERR_F, LINS_IDPERR_F and LINS_HERR_F is generated.
    * |        |          |1 = At least one of LINS_HDET_F, LIN_BKDET_F, BIT_ERR_F, LINS_IDPERR_F and LINS_HERR_F is generated.
    * |        |          |Note: This bit is cleared when LINS_HDET_F, LIN_BKDET_F, BIT_ERR_F, LINS_IDPENR_F and LINS_HERR_F all are cleared.
    * |[8]     |RDA_INT   |Receive Data Available Interrupt Indicator (Read Only)
    * |        |          |This bit is set if RDA_IEN (UA_IER[0]) and RDA_IF (UA_ISR[0]) are both set to 1.
    * |        |          |0 = No RDA interrupt is generated.
    * |        |          |1 = RDA interrupt is generated.
    * |[9]     |THRE_INT  |Transmit Holding Register Empty Interrupt Indicator (Read Only)
    * |        |          |This bit is set if THRE_IEN (UA_IER[1]) and THRE_IF (UA_ISR[1]) are both set to 1.
    * |        |          |0 = No THRE interrupt is generated.
    * |        |          |1 = THRE interrupt is generated.
    * |[10]    |RLS_INT   |Receive Line Status Interrupt Indicator (Read Only)
    * |        |          |This bit is set if RLS_IEN (UA_IER[2]) and RLS_IF (UA_ISR[2]) are both set to 1.
    * |        |          |0 = No RLS interrupt is generated.
    * |        |          |1 = RLS interrupt is generated
    * |[11]    |MODEM_INT |MODEM Status Interrupt Indicator (Read Only)
    * |        |          |This bit is set if MODEM_IEN (UA_IER[3]) and MODEM_IF (UA_ISR[3]) are both set to 1.
    * |        |          |0 = No Modem interrupt is generated.
    * |        |          |1 = Modem interrupt is generated.
    * |[12]    |TOUT_INT  |Rx Time-out Interrupt Indicator (Read Only)
    * |        |          |This bit is set if TOUT_IEN (UA_IER[4]) and TOUT_IF (UA_ISR[4]) are both set to 1.
    * |        |          |0 = No Rx Time-out interrupt is generated.
    * |        |          |1 = Rx Time-out interrupt is generated.
    * |[13]    |BUF_ERR_INT|Buffer Error Interrupt Indicator (Read Only)
    * |        |          |This bit is set if BUF_ERR_IEN (UA_IER[5]) and BUF_ERR_IF (UA_ISR[5]) are both set to 1.
    * |        |          |0 = No buffer error interrupt is generated.
    * |        |          |1 = Buffer error interrupt is generated.
    * |[15]    |LIN_INT   |LIN Bus Interrupt Indicator (Read Only)
    * |        |          |This bit is set if LIN_IEN (UA_IER[8]) and LIN_IF (UA_ISR[7]) are both set to 1.
    * |        |          |0 = No LIN Bus interrupt is generated.
    * |        |          |1 = The LIN Bus interrupt is generated.
    * @var UART_T::TOR
    * Offset: 0x20  UART Time-out Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[7:0]   |TOIC      |Time-out Interrupt Comparator
    * |        |          |The time-out counter resets and starts counting (the counting clock = baud rate) whenever the RX FIFO receives a new data word  if time-out counter is enabled by setting TIME_OUT_EN (UA_IER[11]).
    * |        |          |Once the content of time-out counter is equal to that of time-out interrupt comparator (TOIC (UA_TOR[7:0])), a receiver time-out interrupt is generated if TOUT_IEN (UA_IER[4]) enabled.
    * |        |          |A new incoming data word or RX FIFO empty will clear TOUT_IF (UA_IER[4]).
    * |        |          |In order to avoid receiver time-out interrupt generation immediately during one character is being received, TOIC (UA_TOR[7:0]) value should be set between 40 and 255.
    * |        |          |So, for example, if TOIC (UA_TOR[7:0]) is set with 40, the time-out interrupt is generated after four characters are not received when 1 stop bit and no parity check is set for UART transfer.
    * |[15:8]  |DLY       |TX Delay Time Value
    * |        |          |This field is used to programming the transfer delay time between the last stop bit and next start bit.
    * @var UART_T::BAUD
    * Offset: 0x24  UART Baud Rate Divisor Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[15:0]  |BRD       |Baud Rate Divider
    * |        |          |The field indicates the baud rate divider.
    * |[27:24] |DIVIDER_X |Divider X
    * |        |          |The baud rate divider M = X+1.
    * |[28]    |DIV_X_ONE |Divider X Equal to 1
    * |        |          |0 = Divider M is X+1.
    * |        |          |1 = Divider M is 1.
    * |[29]    |DIV_X_EN  |Divider X Enable Bit
    * |        |          |The BRD = Baud Rate Divider, and the baud rate equation is Baud Rate = Clock / [M * (BRD + 2)]; The default value of M is 16.
    * |        |          |0 = Divider X Disabled (the equation of M = 16).
    * |        |          |1 = Divider X Enabled (the equation of M = X+1, but DIVIDER_X (UA_BAUD[27:24]) must >= 8).
    * |        |          |Note: In IrDA mode, this bit must disable.
    * @var UART_T::IRCR
    * Offset: 0x28  UART IrDA Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[1]     |TX_SELECT |IrDA Receiver/Transmitter Selection Enable Control
    * |        |          |0 = IrDA Transmitter Disabled and Receiver Enabled.
    * |        |          |1 = IrDA Transmitter Enabled and Receiver Disabled.
    * |[5]     |INV_TX    |IrDA inverse Transmitting Output Signal Control
    * |        |          |0 = None inverse transmitting signal.
    * |        |          |1 = Inverse transmitting output signal.
    * |[6]     |INV_RX    |IrDA inverse Receive Input Signal Control
    * |        |          |0 = None inverse receiving input signal.
    * |        |          |1 = Inverse receiving input signal.
    * @var UART_T::ALT_CSR
    * Offset: 0x2C  UART Alternate Control/Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[3:0]   |LIN_BKFL  |UART LIN Break Field Length
    * |        |          |This field indicates a 4-bit LIN TX break field count.
    * |        |          |Note1: This break field length is LIN_BKFL + 1.
    * |        |          |Note2: According to LIN spec, the reset value is 0xC (break field length = 13).
    * |[6]     |LIN_RX_EN |LIN RX Enable Bit
    * |        |          |0 = LIN RX mode Disabled.
    * |        |          |1 = LIN RX mode Enabled.
    * |[7]     |LIN_TX_EN |LIN TX Break Mode Enable Bit
    * |        |          |0 = LIN TX Break mode Disabled.
    * |        |          |1 = LIN TX Break mode Enabled.
    * |        |          |Note: When TX break field transfer operation finished, this bit will be cleared automatically.
    * |[8]     |RS485_NMM |RS-485 Normal Multi-drop Operation Mode (NMM)
    * |        |          |0 = RS-485 Normal Multi-drop Operation mode (NMM) Disabled.
    * |        |          |1 = RS-485 Normal Multi-drop Operation mode (NMM) Enabled.
    * |        |          |Note: It cannot be active with RS-485_AAD operation mode.
    * |[9]     |RS485_AAD |RS-485 Auto Address Detection Operation Mode (AAD)
    * |        |          |0 = RS-485 Auto Address Detection Operation mode (AAD) Disabled.
    * |        |          |1 = RS-485 Auto Address Detection Operation mode (AAD) Enabled.
    * |        |          |Note: It cannot be active with RS-485_NMM operation mode.
    * |[10]    |RS485_AUD |RS-485 Auto Direction Mode (AUD)
    * |        |          |0 = RS-485 Auto Direction Operation mode (AUO) Disabled.
    * |        |          |1 = RS-485 Auto Direction Operation mode (AUO) Enabled.
    * |        |          |Note: It can be active with RS-485_AAD or RS-485_NMM operation mode.
    * |[15]    |RS485_ADD_EN|RS-485 Address Detection Enable Bit
    * |        |          |This bit is used to enable RS-485 Address Detection mode.
    * |        |          |0 = Address detection mode Disabled.
    * |        |          |1 = Address detection mode Enabled.
    * |        |          |Note: This bit is used for RS-485 any operation mode.
    * |[31:24] |ADDR_MATCH|Address Match Value
    * |        |          |This field contains the RS-485 address match values.
    * |        |          |Note: This field is used for RS-485 auto address detection mode.
    * @var UART_T::FUN_SEL
    * Offset: 0x30  UART Function Select Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[1:0]   |FUN_SEL   |Function Select Enable
    * |        |          |00 = UART function Enabled.
    * |        |          |01 = LIN function Enabled.
    * |        |          |10 = IrDA function Enabled.
    * |        |          |11 = RS-485 function Enabled.
    * @var UART_T::LIN_CTL
    * Offset: 0x34  UART LIN Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |LINS_EN   |LIN Slave Mode Enable Control
    * |        |          |0 = LIN slave mode Disabled.
    * |        |          |1 = LIN slave mode Enabled.
    * |[1]     |LINS_HDET_EN|LIN Slave Header Detection Enable Control
    * |        |          |0 = LIN slave header detection Disabled.
    * |        |          |1 = LIN slave header detection Enabled.
    * |        |          |Note1: This bit only valid when in LIN slave mode (LINS_EN (UA_LIN_CTL[0]) = 1).
    * |        |          |Note2: In LIN function mode, when detect header field (break + sync + frame ID), LINS_HDET_F (UA_LIN_SR[0]) flag will be asserted.
    * |        |          |If the LIN_IEN (UA_IER[8]) = 1, an interrupt will be generated.
    * |[2]     |LINS_ARS_EN|LIN Slave Automatic Resynchronization Mode Enable Control
    * |        |          |0 = LIN automatic resynchronization Disabled.
    * |        |          |1 = LIN automatic resynchronization Enabled.    
    * |        |          |Note1: This bit only valid when in LIN slave mode (LINS_EN (UA_LIN_CTL[0]) = 1).
    * |        |          |Note2: When operation in Automatic Resynchronization mode, the baud rate setting must be mode2 (DIV_X_EN (UA_BAUD[29]) and DIV_X_ONE (UA_BAUD[28]) must be 1).
    * |        |          |Note3: The control and interactions of this field are explained in Slave mode with automatic resynchronization section.
    * |[3]     |LINS_DUM_EN|LIN Slave Divider Update Method Enable Control
    * |        |          |0 = UA_BAUD updated is written by software (if no automatic resynchronization update occurs at the same time).
    * |        |          |1 = UA_BAUD is updated at the next received character. User must set the bit before checksum reception.   
    * |        |          |Note1: This bit only valid when in LIN slave mode (LINS_EN (UA_LIN_CTL[0]) = 1).
    * |        |          |Note2: This bit is used for LIN Slave Automatic Resynchronization mode. (for Non-Automatic Resynchronization mode, this bit should be kept cleared) 
    * |        |          |Note3: The control and interactions of this field are explained in Slave mode with automatic resynchronization section.
    * |[4]     |LIN_MUTE_EN|LIN Mute Mode Enable Control
    * |        |          |0 = LIN mute mode Disabled.
    * |        |          |1 = LIN mute mode Enabled.
    * |        |          |Note: The exit from mute mode condition and each control and interactions of this field are explained in (LIN slave mode).
    * |[8]     |LIN_SHD   |LIN TX Send Header Enable Control
    * |        |          |The LIN TX header can be "break field" or "break and sync field" or "break, sync and frame ID field", it is depend on setting LIN_HEAD_SEL (UA_LIN_CTL[23:22]).
    * |        |          |0 = Send LIN TX header Disabled.
    * |        |          |1 = Send LIN TX header Enabled.
    * |        |          |Note1: Tis bit is shadow bit of LIN_TX_EN (UA_ALT_CSR[7]); user can read/write it by setting LIN_TX_EN (UA_ALT_CSR[7]) or LIN_SHD (UA_LIN_CTL[8]).    
    * |        |          |Note2: When transmitter header field (it may be "break" or "break + sync" or "break + sync + frame ID" selected by LIN_HEAD_SEL (UA_LIN_CTL[23:22]) field) transfer operation finished, this bit will be cleared automatically.
    * |[9]     |LIN_IDPEN |LIN ID Parity Enable Control
    * |        |          |0 = LIN frame ID parity Disabled.
    * |        |          |1 = LIN frame ID parity Enabled.
    * |        |          |Note1: This bit can be used for LIN master to sending header field LIN_SHD (UA_LIN_CTL[8]) = 1 and LIN_HEAD_SEL (UA_LIN_CTL[23:22]) = 10) or be used for enable LIN slave received frame ID parity checked.
    * |        |          |Note2: This bit is only use when operation header transmitter is in LIN_HEAD_SEL (UA_LIN_CTL[23:22]) = 10.
    * |[10]    |LIN_BKDET_EN|LIN Break Detection Enable Control
    * |        |          |When detect consecutive dominant greater than 11 bits, and are followed by a delimiter character, the LIN_BKDET_F (UA_LIN_SR[8]) flag is set in UA_LIN_SR register at the end of break field.
    * |        |          |If the LIN_IEN (UA_IER[8]) = 1, an interrupt will be generated.
    * |        |          |0 = LIN break detection Disabled.
    * |        |          |1 = LIN break detection Enabled.
    * |[11]    |LIN_RX_DIS|LIN Receiver Disable Control
    * |        |          |If the receiver is enabled (LIN_RX_DIS (UA_LIN_CTL[11]) = 0), all received byte data will be accepted and stored in the RX-FIFO, and if the receiver is disabled (LIN_RX_DIS (UA_LIN_CTL[11]) = 1), all received byte data will be ignore.
    * |        |          |0 = LIN receiver Enabled.
    * |        |          |1 = LIN receiver Disabled.
    * |        |          |Note: This bit is only valid when operating in LIN function mode (FUN_SEL (UA_FUN_SEL[1:0]) = 01).
    * |[12]    |BIT_ERR_EN|Bit Error Detect Enable Control
    * |        |          |0 = Bit error detection function Disabled.
    * |        |          |1 = Bit error detection Enabled.
    * |        |          |Note: In LIN function mode, when occur bit error, the BIT_ERR_F (UA_LIN_SR[9]) flag will be asserted.
    * |        |          |If the LIN_IEN (UA_IER[8]) = 1, an interrupt will be generated.
    * |[19:16] |LIN_BKFL  |LIN Break Field Length
    * |        |          |This field indicates a 4-bit LIN TX break field count.
    * |        |          |Note1: These registers are shadow registers of LIN_BKFL (UA_ALT_CSR[19:16]), User can read/write it by setting LIN_BKFL (UA_ALT_CSR[3:0]) or LIN_BKFL (UA_LIN_CTL[19:16]).
    * |        |          |Note2: This break field length is LIN_BKFL + 1.
    * |        |          |Note3: According to LIN spec, the reset value is 0xC (break field length = 13).
    * |[21:20] |LIN_BS_LEN|LIN Break/Sync Delimiter Length
    * |        |          |00 = The LIN break/sync delimiter length is 1 bit time.
    * |        |          |10 = The LIN break/sync delimiter length is 2 bit time.
    * |        |          |10 = The LIN break/sync delimiter length is 3 bit time.
    * |        |          |11 = The LIN break/sync delimiter length is 4 bit time.
    * |        |          |Note: This bit used for LIN master to sending header field.
    * |[23:22] |LIN_HEAD_SEL|LIN Header Select
    * |        |          |00 = The LIN header includes "break field".
    * |        |          |01 = The LIN header includes "break field" and "sync field".
    * |        |          |10 = The LIN header includes "break field", "sync field" and "frame ID field".
    * |        |          |11 = Reserved.
    * |        |          |Note: This bit is used to master mode for LIN to send header field (LIN_SHD (UA_LIN_CTL[8]) = 1) or used to slave to indicates exit from mute mode condition (LIN_MUTE_EN (UA_LIN_CTL[4]) = 1).
    * |[31:24] |LIN_PID   |LIN PID Register
    * |        |          |This field contains the LIN frame ID value when in LIN function mode, the frame ID parity can be generated by software or hardware depends on LIN_IDPEN (UA_LIN_CTL[9]) = 1.
    * |        |          |If the parity generated by hardware, user fill ID0~ID5, (LIN_PID [29:24] )hardware will calculate P0 (LIN_PID[30]) and P1 (LIN_PID[31]), otherwise user must filled frame ID and parity in this field.
    * |        |          |Note1: User can fill any 8-bit value to this field and the bit 24 indicates ID0 (LSB first).
    * |        |          |Note2: This field can be used for LIN master mode or slave mode.
    * @var UART_T::LIN_SR
    * Offset: 0x38  UART LIN Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |LINS_HDET_F|LIN Slave Header Detection Flag
    * |        |          |This bit is set by hardware when a LIN header is detected in LIN slave mode.
    * |        |          |0 = LIN header not detected.
    * |        |          |1 = LIN header detected (break + sync + frame ID).
    * |        |          |Note1: This bit can be cleared by writing "1" to it.
    * |        |          |Note2: This bit is only valid when in LIN slave mode (LINS_EN (UA_LIN_CTL [0]) = 1) and enable LIN slave header detection function (LINS_HDET_EN (UA_LIN_CTL [1])).
    * |        |          |Note3: When enable ID parity check LIN_IDPEN (UA_LIN_CTL[9]), if hardware detect complete header ("break + sync + frame ID"), the LINS_HEDT_F will be set whether the frame ID correct or not.
    * |[1]     |LINS_HERR_F|LIN Slave Header Error Flag
    * |        |          |This bit is set by hardware when a LIN header error is detected in LIN slave mode.
    * |        |          |The header errors include "break delimiter is too short (less than 0.5 bit time)", "frame error in sync field or Identifier field", "sync field data is not 0x55 in Non-Automatic Resynchronization mode", "sync field deviation error with Automatic Resynchronization mode", "sync field measure time-out with Automatic Resynchronization mode" and "LIN header reception time-out".
    * |        |          |0 = LIN header error not detected.
    * |        |          |1 = LIN header error detected.
    * |        |          |Note1: This bit can be cleared by writing "1" to it.
    * |        |          |Note2: This bit is only valid when UART is operated in LIN slave mode (LINS_EN (UA_LIN_CTL[0]) = 1) and enables LIN slave header detection function (LINS_HDET_EN (UA_LIN_CTL[1])).
